<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>Enterprise Connect Custom Settings</string>
        <key>pfm_title</key>
        <string>Enterprise Connect</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.Enterprise-Connect</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>debugMode</string>
                <key>pfm_title</key>
                <string>debugMode</string>
                <key>pfm_description</key>
                <string>Enable Debug Mode</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>kerbCacheName</string>
                <key>pfm_title</key>
                <string>kerbCacheName</string>
                <key>pfm_description</key>
                <string>NA</string>
                <key>pfm_type</key>
                <string>dict</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>kerbCacheName</string>
                <key>pfm_title</key>
                <string>kerbCacheName</string>
                <key>pfm_description</key>
                <string>NA</string>
                <key>pfm_type</key>
                <string>dict</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>preferredDC</string>
                <key>pfm_title</key>
                <string>preferredDC</string>
                <key>pfm_description</key>
                <string>Preferred Domain Controller. Use the fully qualified name of the domain controller.</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>adRealm</string>
                <key>pfm_title</key>
                <string>adRealm</string>
                <key>pfm_description</key>
                <string>Active Directory Kerberos Realm</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>lastSiteName</string>
                <key>pfm_title</key>
                <string>lastSiteName</string>
                <key>pfm_description</key>
                <string>Last contacted site name. Treat this as read only.</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
        </array>
    </dict>
</plist>
