<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>Microsoft Office 2016</string>
        <key>pfm_title</key>
        <string>Microsoft Office 2016</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.ManagedClient.preferences</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Payload Description</string>
                <key>pfm_description</key>
                <string>Description of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Microsoft Office Custom Settings</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
                <key>pfm_description</key>
                <string>Name of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Microsoft Office Custom Settings</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
                <key>pfm_description</key>
                <string>A unique identifier for the payload, dot-delimited. Usually root
                    PayloadIdentifier+subidentifier
                </string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.microsoft.office</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
                <key>pfm_description</key>
                <string>The type of the payload, a reverse dns string</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.microsoft.office</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
                <key>pfm_description</key>
                <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string></string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
                <key>pfm_description</key>
                <string>The version of the whole configuration profile.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
                <key>pfm_description</key>
                <string>This value describes the issuing organization of the profile, as displayed to the user</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadContent</string>
                <key>pfm_title</key>
                <string>Payload Content</string>
                <key>pfm_description</key>
                <string>An array of PayloadContent describing individual preferences</string>
                <key>pfm_type</key>
                <string>dict</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>com.microsoft.office</string>
                        <key>pfm_title</key>
                        <string>Office Custom Settings</string>
                        <key>pfm_description</key>
                        <string>Office Custom Settings</string>
                        <key>pfm_type</key>
                        <string>dict</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>Forced</string>
                                <key>pfm_title</key>
                                <string>Forced</string>
                                <key>pfm_description</key>
                                <string>Forced, which corresponds to the old MCX 'Always' setting. The setting is always
                                    managed
                                </string>
                                <key>pfm_type</key>
                                <string>array</string>
                                <key>pfm_subkeys</key>
                                <array>
                                    <dict>
                                        <key>pfm_name</key>
                                        <string>ForcedItem</string>
                                        <key>pfm_title</key>
                                        <string>Forced Preference Key</string>
                                        <key>pfm_description</key>
                                        <string>A dictionary that describes settings that are forced</string>
                                        <key>pfm_type</key>
                                        <string>dict</string>
                                        <key>pfm_subkeys</key>
                                        <array>
                                            <dict>
                                                <key>pfm_name</key>
                                                <string>mcx_preference_settings</string>
                                                <key>pfm_title</key>
                                                <string>The preferences to set</string>
                                                <key>pfm_description</key>
                                                <string>A dict containing preferences that will be enforced</string>
                                                <key>pfm_type</key>
                                                <string>dict</string>
                                                <key>pfm_subkeys</key>
                                                <array>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>kCUIThemePreferencesThemeKeyPath</string>
                                                        <key>pfm_title</key>
                                                        <string>Colorful Theme</string>
                                                        <key>pfm_description</key>
                                                        <string>Sets Office theme: 0 - Colorful, 1 - Classic</string>
                                                        <key>pfm_type</key>
                                                        <string>integer</string>
                                                    </dict>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>OfficeActivationEmailAddress</string>
                                                        <key>pfm_title</key>
                                                        <string>Set Belongs to field</string>
                                                        <key>pfm_description</key>
                                                        <string>Sets value of 'Belongs to' field in the About Box. This happens automatically on 15.33+ installs</string>
                                                        <key>pfm_type</key>
                                                        <string>string</string>
                                                    </dict>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>DefaultsToLocalOpenSave</string>
                                                        <key>pfm_title</key>
                                                        <string>Save/Open defaults to 'On my Mac'</string>
                                                        <key>pfm_description</key>
                                                        <string>When set to true will force the open/save panel to ‘On my Mac’ instead of 'Online Locations'</string>
                                                        <key>pfm_type</key>
                                                        <string>boolean</string>
                                                        <key>pfm_default</key>
                                                        <false/>
                                                    </dict>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>ShowWhatsNewOnLaunch</string>
                                                        <key>pfm_title</key>
                                                        <string>Show 'Whats New' dialog on launch</string>
                                                        <key>pfm_description</key>
                                                        <string>Replaces the 'OUIWhatsNewShownItemIds' key as a single place to remove all "What's new" messages for all suite apps:
                                                            Word, PowerPoint, Excel, Outlook, and OneNote. In build 170420 and later.</string>
                                                        <key>pfm_type</key>
                                                        <string>boolean</string>
                                                        <key>pfm_default</key>
                                                        <true/>
                                                    </dict>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>VisualBasicMacroExecutionState</string>
                                                        <key>pfm_title</key>
                                                        <string>VisualBasic Macro security level</string>
                                                        <key>pfm_description</key>
                                                        <string>Sets the VisualBasic Macro security level. Valid values: DisabledWithoutWarnings, DisabledWithWarnings, EnabledWithWarnings</string>
                                                        <key>pfm_type</key>
                                                        <string>string</string>
                                                        <key>pfm_range_list</key>
                                                        <array>
                                                            <string>DisabledWithoutWarnings</string>
                                                            <string>DisabledWithWarnings</string>
                                                            <string>EnabledWithWarnings</string>
                                                        </array>
                                                        <key>pfm_default</key>
                                                        <string>DisabledWithWarnings</string>
                                                    </dict>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>msoridEnableLogging</string>
                                                        <key>pfm_title</key>
                                                        <string>authentication logging</string>
                                                        <key>pfm_description</key>
                                                        <string>Set to 1 to increase logging levels for authentication requests</string>
                                                        <key>pfm_type</key>
                                                        <string>integer</string>
                                                        <key>pfm_default</key>
                                                        <integer>0</integer>
                                                    </dict>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>msoridDefaultMinimumSeverity</string>
                                                        <key>pfm_title</key>
                                                        <string>msoridDefaultMinimumSeverity</string>
                                                        <key>pfm_description</key>
                                                        <string>Set value to 200 if msoridEnableLogging is enabled</string>
                                                        <key>pfm_type</key>
                                                        <string>integer</string>
                                                    </dict>
                                                </array>
                                            </dict>
                                        </array>
                                    </dict>
                                </array>
                            </dict>
                        </array>
                    </dict>
                </array>
            </dict>
        </array>
    </dict>
</plist>
