<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>Microsoft OneDrive</string>
        <key>pfm_title</key>
        <string>Microsoft OneDrive</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.ManagedClient.preferences</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Payload Description</string>
                <key>pfm_description</key>
                <string>Description of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Microsoft OneDrive Custom Settings</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
                <key>pfm_description</key>
                <string>Name of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Microsoft OneDrive Custom Settings</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
                <key>pfm_description</key>
                <string>A unique identifier for the payload, dot-delimited. Usually root
                    PayloadIdentifier+subidentifier
                </string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.microsoft.OneDrive</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
                <key>pfm_description</key>
                <string>The type of the payload, a reverse dns string</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.microsoft.OneDrive</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
                <key>pfm_description</key>
                <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string></string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
                <key>pfm_description</key>
                <string>The version of the whole configuration profile.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
                <key>pfm_description</key>
                <string>This value describes the issuing organization of the profile, as displayed to the user</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadContent</string>
                <key>pfm_title</key>
                <string>Payload Content</string>
                <key>pfm_description</key>
                <string>An array of PayloadContent describing individual preferences</string>
                <key>pfm_type</key>
                <string>dict</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>com.microsoft.OneDrive</string>
                        <key>pfm_title</key>
                        <string>OneDrive Custom Settings</string>
                        <key>pfm_description</key>
                        <string>OneDrive Custom Settings</string>
                        <key>pfm_type</key>
                        <string>dict</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>Forced</string>
                                <key>pfm_title</key>
                                <string>Forced</string>
                                <key>pfm_description</key>
                                <string>Forced, which corresponds to the old MCX 'Always' setting. The setting is always
                                    managed
                                </string>
                                <key>pfm_type</key>
                                <string>array</string>
                                <key>pfm_subkeys</key>
                                <array>
                                    <dict>
                                        <key>pfm_name</key>
                                        <string>ForcedItem</string>
                                        <key>pfm_title</key>
                                        <string>Forced Preference Key</string>
                                        <key>pfm_description</key>
                                        <string>A dictionary that describes settings that are forced</string>
                                        <key>pfm_type</key>
                                        <string>dict</string>
                                        <key>pfm_subkeys</key>
                                        <array>
                                            <dict>
                                                <key>pfm_name</key>
                                                <string>mcx_preference_settings</string>
                                                <key>pfm_title</key>
                                                <string>The preferences to set</string>
                                                <key>pfm_description</key>
                                                <string>A dict containing preferences that will be enforced</string>
                                                <key>pfm_type</key>
                                                <string>dict</string>
                                                <key>pfm_subkeys</key>
                                                <array>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>DisablePersonalSync</string>
                                                        <key>pfm_title</key>
                                                        <string>Disable personal OneDrive accounts</string>
                                                        <key>pfm_description</key>
                                                        <string>Blocks users from signing in and syncing files in personal OneDrive accounts.
                                                            If this key is set after a user has set up sync with a personal account, the user will be signed out.</string>
                                                        <key>pfm_type</key>
                                                        <string>boolean</string>
                                                    </dict>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>AutomaticUploadBandwidthPercentage</string>
                                                        <key>pfm_title</key>
                                                        <string>Percentage of local bandwidth used</string>
                                                        <key>pfm_description</key>
                                                        <string>This parameter determines the percentage of local upload bandwidth that the sync client can use. Accepted values are from 1 through 99.</string>
                                                        <key>pfm_range_min</key>
                                                        <integer>1</integer>
                                                        <key>pfm_range_max</key>
                                                        <integer>99</integer>
                                                        <key>pfm_type</key>
                                                        <string>integer</string>
                                                    </dict>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>HideDockIcon</string>
                                                        <key>pfm_title</key>
                                                        <string>Hide the OneDrive dock icon when running</string>
                                                        <key>pfm_description</key>
                                                        <string>When set to true, this parameter hides the OneDrive dock icon even when the application is running.</string>
                                                        <key>pfm_type</key>
                                                        <string>boolean</string>
                                                    </dict>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>IsBusinessProvisioned</string>
                                                        <key>pfm_title</key>
                                                        <string>IsBusinessProvisioned</string>
                                                        <key>pfm_description</key>
                                                        <string></string>
                                                        <key>pfm_type</key>
                                                        <string>boolean</string>
                                                    </dict>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>DefaultToBusinessFRE</string>
                                                        <key>pfm_title</key>
                                                        <string>Default to OneDrive Business</string>
                                                        <key>pfm_description</key>
                                                        <string>Default to OneDrive Business instead of OneDrive Personal</string>
                                                        <key>pfm_type</key>
                                                        <string>boolean</string>
                                                    </dict>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>EnableAddAccounts</string>
                                                        <key>pfm_title</key>
                                                        <string>Allow users to add accounts to OneDrive</string>
                                                        <key>pfm_description</key>
                                                        <string>Allow users to add accounts to OneDrive</string>
                                                        <key>pfm_type</key>
                                                        <string>boolean</string>
                                                    </dict>
                                                    <dict>
                                                        <key>pfm_name</key>
                                                        <string>Tenants</string>
                                                        <key>pfm_title</key>
                                                        <string>Specify default location by tenant</string>
                                                        <key>pfm_description</key>
                                                        <string>Specifies the default location of the OneDrive folder for each tenant</string>
                                                        <key>pfm_type</key>
                                                        <string>dict</string>
                                                        <key>pfm_subkeys</key>
                                                        <array>
                                                            <dict>
                                                                <key>pfm_name</key>
                                                                <string>TenantID</string>
                                                                <key>pfm_title</key>
                                                                <string>Tenant ID Here</string>
                                                                <key>pfm_description</key>
                                                                <string>Place the Tenant ID here</string>
                                                                <key>pfm_type</key>
                                                                <string>dict</string>
                                                                <key>pfm_subkeys</key>
                                                                <array>
                                                                    <dict>
                                                                        <key>pfm_name</key>
                                                                        <string>DefaultFolder</string>
                                                                        <key>pfm_title</key>
                                                                        <string>Default Folder Location</string>
                                                                        <key>pfm_description</key>
                                                                        <string>Default Folder Location, must already exist</string>
                                                                        <key>pfm_type</key>
                                                                        <string>string</string>
                                                                    </dict>
                                                                </array>
                                                            </dict>
                                                        </array>
                                                    </dict>
                                                </array>
                                            </dict>
                                        </array>
                                    </dict>
                                </array>
                            </dict>
                        </array>
                    </dict>
                </array>
            </dict>
        </array>
    </dict>
</plist>
