<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>Login Items</string>
        <key>pfm_title</key>
        <string>Login Items</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.loginitems.managed</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Payload Description</string>
                <key>pfm_description</key>
                <string>Description of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Login Items</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
                <key>pfm_description</key>
                <string>Name of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Login Items</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
                <key>pfm_description</key>
                <string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.loginitems.managed</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
                <key>pfm_description</key>
                <string>The type of the payload, a reverse dns string</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.loginitems.managed</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
                <key>pfm_description</key>
                <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string></string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
                <key>pfm_description</key>
                <string>The version of the whole configuration profile.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
                <key>pfm_description</key>
                <string>This value describes the issuing organization of the profile, as displayed to the user</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>DisableLoginItemsSuppression</string>
                <key>pfm_title</key>
                <string>Disable shift to suppress login items</string>
                <key>pfm_description</key>
                <string>Disable shift to suppress login items</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>AutoLaunchedApplicationDictionary-managed</string>
                <key>pfm_title</key>
                <string>Automatically launched applications</string>
                <key>pfm_description</key>
                <string>Automatically launch these applications at login</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>AutoLaunchedApplicationItem</string>
                        <key>pfm_title</key>
                        <string>Login Item</string>
                        <key>pfm_description</key>
                        <string>Automatically Launched Login Item</string>
                        <key>pfm_type</key>
                        <string>dictionary</string>
                        <key>pfm_require</key>
                        <string>always</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>Path</string>
                                <key>pfm_title</key>
                                <string>Path</string>
                                <key>pfm_description</key>
                                <string>Path to the application bundle to launch</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>URL</string>
                                <key>pfm_title</key>
                                <string>URL</string>
                                <key>pfm_description</key>
                                <string>URL to mount in the form scheme://mount.point/Share</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>AuthenticateAsLoginUserShortName</string>
                                <key>pfm_title</key>
                                <string>Authenticate with short name</string>
                                <key>pfm_description</key>
                                <string>Authenticate to the URL with the current users short name. Required if URL is specified, but not for Path</string>
                                <key>pfm_type</key>
                                <string>boolean</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>Hide</string>
                                <key>pfm_title</key>
                                <string>Hide</string>
                                <key>pfm_description</key>
                                <string>Hide application at launch</string>
                                <key>pfm_type</key>
                                <string>boolean</string>
                                <key>pfm_require</key>
                                <string>always</string>
                                <key>pfm_default</key>
                                <false/>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>MCX-NetworkHomeDirectoryItem</string>
                                <key>pfm_title</key>
                                <string>Mount network home</string>
                                <key>pfm_description</key>
                                <string>Mount network home</string>
                                <key>pfm_type</key>
                                <string>boolean</string>
                            </dict>
                        </array>
                    </dict>
                </array>
            </dict>
        </array>
    </dict>
</plist>
