<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>Custom Settings, also called CFPreferences or MCX Preferences</string>
        <key>pfm_title</key>
        <string>Custom Settings</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.ManagedClient.preferences</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Payload Description</string>
                <key>pfm_description</key>
                <string>Description of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>FileVault 2</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
                <key>pfm_description</key>
                <string>Name of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>FileVault 2</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
                <key>pfm_description</key>
                <string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.MCX.FileVault2</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
                <key>pfm_description</key>
                <string>The type of the payload, a reverse dns string</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.MCX.FileVault2</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
                <key>pfm_description</key>
                <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string></string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
                <key>pfm_description</key>
                <string>The version of the whole configuration profile.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
                <key>pfm_description</key>
                <string>This value describes the issuing organization of the profile, as displayed to the user</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadContent</string>
                <key>pfm_title</key>
                <string>Payload Content</string>
                <key>pfm_description</key>
                <string>An array of PayloadContent describing individual preferences</string>
                <key>pfm_type</key>
                <string>dict</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>preference.domain</string>
                        <key>pfm_title</key>
                        <string>Target Preference Domain</string>
                        <key>pfm_description</key>
                        <string>The preference domain that will be modified by this setting.</string>
                        <key>pfm_type</key>
                        <string>dict</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>Forced</string>
                                <key>pfm_title</key>
                                <string>Forced</string>
                                <key>pfm_description</key>
                                <string>Forced, which corresponds to the old MCX 'Always' setting. The setting is always managed</string>
                                <key>pfm_type</key>
                                <string>array</string>
                                <key>pfm_subkeys</key>
                                <array>
                                    <dict>
                                        <key>pfm_name</key>
                                        <string>ForcedItem</string>
                                        <key>pfm_title</key>
                                        <string>Forced Preference Key</string>
                                        <key>pfm_description</key>
                                        <string>A dictionary that describes settings that are forced</string>
                                        <key>pfm_type</key>
                                        <string>dict</string>
                                        <key>pfm_subkeys</key>
                                        <array>
                                            <dict>
                                                <key>pfm_name</key>
                                                <string>mcx_preference_settings</string>
                                                <key>pfm_title</key>
                                                <string>The preferences to set</string>
                                                <key>pfm_description</key>
                                                <string>A dict containing preferences that will be enforced</string>
                                                <key>pfm_type</key>
                                                <string>dict</string>
                                            </dict>
                                        </array>
                                    </dict>
                                </array>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>Set-Once</string>
                                <key>pfm_title</key>
                                <string>Set Once</string>
                                <key>pfm_description</key>
                                <string>Set Once, which corresponds to the old MCX 'Often' or 'Once' setting. The setting is once or sometimes managed. 'Often' has been deprecated.</string>
                                <key>pfm_type</key>
                                <string>array</string>
                                <key>pfm_subkeys</key>
                                <array>
                                    <dict>
                                        <key>pfm_name</key>
                                        <string>OnceItem</string>
                                        <key>pfm_title</key>
                                        <string>Set Once Preference Key</string>
                                        <key>pfm_description</key>
                                        <string>A dictionary that describes settings that are set once</string>
                                        <key>pfm_type</key>
                                        <string>dict</string>
                                        <key>pfm_subkeys</key>
                                        <array>
                                            <dict>
                                                <key>pfm_name</key>
                                                <string>mcx_preference_settings</string>
                                                <key>pfm_title</key>
                                                <string>The preferences to set</string>
                                                <key>pfm_description</key>
                                                <string>A dict containing preferences that will be enforced</string>
                                                <key>pfm_type</key>
                                                <string>dict</string>
                                            </dict>
                                            <dict>
                                                <key>pfm_name</key>
                                                <string>mcx_data_timestamp</string>
                                                <key>pfm_title</key>
                                                <string>Set once timestamp</string>
                                                <key>pfm_description</key>
                                                <string>A timestamp that is used to determine whether the setting has been applied once</string>
                                                <key>pfm_type</key>
                                                <string>date</string>
                                            </dict>
                                        </array>
                                    </dict>
                                </array>
                            </dict>
                        </array>
                    </dict>
                </array>
            </dict>
        </array>
    </dict>
</plist>
