<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define restrictions settings</string>
	<key>pfm_title</key>
	<string>Restrictions</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_version</key>
	<integer>1</integer>
	<key>pfm_domain</key>
	<string>com.apple.applicationaccess</string>
	<key>pfm_note</key>
	<string>Modified from AC2 distribution</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>Configures restrictions</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>Restrictions</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.applicationaccess</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.applicationaccess</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowAccountModification</string>
			<key>pfm_title</key>
			<string>Allow user to modify accounts</string>
			<key>pfm_description</key>
			<string>Allow user to modify accounts</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_supervised</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowAirDrop</string>
			<key>pfm_title</key>
			<string>Disable AirDrop</string>
			<key>pfm_description</key>
			<string>Disable AirDrop if set to false</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_supervised</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowAppInstallation</string>
			<key>pfm_title</key>
			<string>Allow App Installation from Apple Configurator and iTunes</string>
			<key>pfm_description</key>
			<string>Allow only a connected Mac host to install applications</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowUIAppInstallation</string>
			<key>pfm_title</key>
			<string>Allow App Installation from App Store</string>
			<key>pfm_description</key>
			<string>When false, the App Store is disabled and its icon is removed from the Home screen. However, users may continue to use Host apps (iTunes, Configurator) to install or update their apps.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowAutomaticAppDownloads</string>
			<key>pfm_title</key>
			<string>Allow Automatic App Downloads</string>
			<key>pfm_description</key>
			<string>If set to false, prevents automatic downloading of apps purchased on other devices. Does not affect updates to existing apps. Defaults to true</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowAppRemoval</string>
			<key>pfm_title</key>
			<string>Allow App Removal</string>
			<key>pfm_description</key>
			<string>Allow the user to remove apps (Supervised only)</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowEnterpriseAppTrust</string>
			<key>pfm_title</key>
			<string>Allow Trusting Enterprise Apps</string>
			<key>pfm_description</key>
			<string>If set to false removes the Trust Enterprise Developer button in Settings->General->Profiles Device Management, preventing apps from being provisioned by universal provisioning profiles. This restriction applies to free developer accounts but it does not apply to enterprise app developers who are trusted because their apps were pushed via MDM, nor does it revoke previously granted trust. Defaults to true.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCamera</string>
			<key>pfm_title</key>
			<string>Allow Camera Use</string>
			<key>pfm_description</key>
			<string>Allow the user to use the camera</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>0.0</string>
			<key>pfm_macos_min</key>
			<string>10.11</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowExplicitContent</string>
			<key>pfm_title</key>
			<string>Allow Explicit Content</string>
			<key>pfm_description</key>
			<string>Allow user access of explicit content</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowFindMyFriendsModification</string>
			<key>pfm_title</key>
			<string>Allow Find My Friends changes</string>
			<key>pfm_description</key>
			<string>If set to false, changes to Find My Friends are disabled.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowScreenShot</string>
			<key>pfm_title</key>
			<string>Allow Screenshots and Screen Recording</string>
			<key>pfm_description</key>
			<string>Allow the user to take screenshots or screen recordings</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
        <dict>
            <key>pfm_name</key>
            <string>allowRemoteScreenObservation</string>
            <key>pfm_title</key>
            <string>Allow Remote Screen Observation</string>
            <key>pfm_description</key>
            <string>Allow Classroom or similar to observe the screen. This key should be nested beneath allowScreenShot as a sub-restriction. If allowScreenShot is set to false, it also prevents the Classroom app from observing remote screens.</string>
            <key>pfm_type</key>
            <string>boolean</string>
            <key>pfm_default</key>
            <true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.3</string>
        </dict>
		<dict>
			<key>pfm_name</key>
			<string>allowChat</string>
			<key>pfm_title</key>
			<string>Allow use of iMessage</string>
			<key>pfm_description</key>
			<string>Allow use of iMessage (Supervised only)</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>6.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowBookstore</string>
			<key>pfm_title</key>
			<string>Allow Bookstore</string>
			<key>pfm_description</key>
			<string>Supervised only. If set to false, iBookstore will be disabled.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>6.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowBookstoreErotica</string>
			<key>pfm_title</key>
			<string>Allow Bookstore Erotica</string>
			<key>pfm_description</key>
			<string>Supervised only. If set to false, the user will not be able to download media from the iBookstore that is tagged as erotica.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>6.0</string>
		</dict>
        <dict>
            <key>pfm_name</key>
            <string>allowMusicService</string>
            <key>pfm_title</key>
            <string>Allow Apple Music</string>
            <key>pfm_description</key>
            <string>If set to false, Apple Music will be disabled in the Music app.</string>
            <key>pfm_type</key>
            <string>boolean</string>
            <key>pfm_default</key>
            <true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.3</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
        </dict>
        <dict>
            <key>pfm_name</key>
            <string>allowRadioService</string>
            <key>pfm_title</key>
            <string>Allow iTunes Radio</string>
            <key>pfm_description</key>
            <string>If set to false, Apple Music Radio is disabled.</string>
            <key>pfm_type</key>
            <string>boolean</string>
            <key>pfm_default</key>
            <true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.3</string>
        </dict>
		<dict>
			<key>pfm_name</key>
			<string>allowSharedStream</string>
			<key>pfm_title</key>
			<string>Allow Shared Stream</string>
			<key>pfm_description</key>
			<string>If set to false, disabled Shared Stream.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>6.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowPassbookWhileLocked</string>
			<key>pfm_title</key>
			<string>Allow Wallet While Locked</string>
			<key>pfm_description</key>
			<string>If set to false, Wallet notifications will not be shown on the lock screen.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>6.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowUIConfigurationProfileInstallation</string>
			<key>pfm_title</key>
			<string>Allow UI Configuration Profile Installation</string>
			<key>pfm_description</key>
			<string>Supervised only. If set to false, the user is prohibited from installing configuration profiles and certificates interactively.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>6.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowiTunes</string>
			<key>pfm_title</key>
			<string>Allow use of iTunes</string>
			<key>pfm_description</key>
			<string>When false, the iTunes Music Store is disabled and its icon is removed from the Home screen. Users cannot preview, purchase, or download content.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>autonomousSingleAppModePermittedAppIDs</string>
			<key>pfm_title</key>
			<string>Allow apps to enter single app mode themselves.</string>
			<key>pfm_description</key>
			<string>If present, allows apps identified by the bundle IDs listed in the array to autonomously enter Single App Mode.</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>SingleAppModePermittedAppIDItem</string>
					<key>pfm_title</key>
					<string>App Bundle ID Allowed to enter Single App Mode</string>
					<key>pfm_description</key>
					<string>App Bundle ID specified will be allowed to enter Single App Mode autonomously.</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowNews</string>
			<key>pfm_title</key>
			<string>Allow use of News</string>
			<key>pfm_description</key>
			<string>Allow the user to access and use News</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowSafari</string>
			<key>pfm_title</key>
			<string>Allow use of Safari</string>
			<key>pfm_description</key>
			<string>Allow the user to use Safari</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowGameCenter</string>
			<key>pfm_title</key>
			<string>Allow Game Center</string>
			<key>pfm_description</key>
			<string>Allow Game Center (Supervised only)</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>6.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowAddingGameCenterFriends</string>
			<key>pfm_title</key>
			<string>Allow Adding Game Center Friends</string>
			<key>pfm_description</key>
			<string>Allow the user to add Friends on Game Center</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
		</dict>
        <dict>
            <key>pfm_name</key>
            <string>allowBluetoothModification</string>
            <key>pfm_title</key>
            <string>Allow modifying Bluetooth settings</string>
            <key>pfm_description</key>
            <string>Allow modifying Bluetooth settings</string>
            <key>pfm_type</key>
            <string>boolean</string>
            <key>pfm_default</key>
            <true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>10.0</string>
        </dict>
		<dict>
			<key>pfm_name</key>
			<string>allowAppCellularDataModification</string>
			<key>pfm_title</key>
			<string>Allow Modifying Cellular Data Usage for Apps Settings</string>
			<key>pfm_description</key>
			<string>Allow modifying cellular data usage for apps settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowDeviceNameModification</string>
			<key>pfm_title</key>
			<string>Allow Modifying Device Name</string>
			<key>pfm_description</key>
			<string>Allow modifying device name</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowPasscodeModification</string>
			<key>pfm_title</key>
			<string>Allow Modifying Passcode</string>
			<key>pfm_description</key>
			<string>If set to false, prevents the device passcode from being added, changed, or removed. Defaults to true. This restriction is ignored by shared iPads.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowWallpaperModification</string>
			<key>pfm_title</key>
			<string>Allow Modifying Wallpaper</string>
			<key>pfm_description</key>
			<string>Allow modifying Wallpaper (Supervised only)</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowEnablingRestrictions</string>
			<key>pfm_title</key>
			<string>Allow Configuring Restrictions</string>
			<key>pfm_description</key>
			<string>Allow configuring restrictions (Supervised only)</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowGlobalBackgroundFetchWhenRoaming</string>
			<key>pfm_title</key>
			<string>Allow Automatic Sync While Roaming</string>
			<key>pfm_description</key>
			<string>Allow automatic sync while roaming</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowManagedAppsCloudSync</string>
			<key>pfm_title</key>
			<string>Allow iCloud Sync for Managed Apps</string>
			<key>pfm_description</key>
			<string>Allow iCloud sync for managed apps</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowEnterpriseBookBackup</string>
			<key>pfm_title</key>
			<string>Allow Enterprise Books Backup</string>
			<key>pfm_description</key>
			<string>Allow enterprise books to be backed up</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowEnterpriseBookMetadataSync</string>
			<key>pfm_title</key>
			<string>Allow Enterprise Books Notes and Highlights Sync</string>
			<key>pfm_description</key>
			<string>Allow enterprise books notes and highlights to be synced</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowInAppPurchases</string>
			<key>pfm_title</key>
			<string>Allow In App Purchases</string>
			<key>pfm_description</key>
			<string>Allow the user to make purchases within applications</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowPodcasts</string>
			<key>pfm_title</key>
			<string>Allow Podcasts</string>
			<key>pfm_description</key>
			<string>If set to false, disables podcasts. Defaults to true.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>8.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowLockScreenControlCenter</string>
			<key>pfm_title</key>
			<string>Allow Control Center on Lock Screen</string>
			<key>pfm_description</key>
			<string>If false, prevents Control Center from appearing on the Lock screen.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowHostPairing</string>
			<key>pfm_title</key>
			<string>Allow pairing with any host</string>
			<key>pfm_description</key>
			<string>If set to false, host pairing is disabled with the exception of the supervision host. If no supervision host certificate has been configured, all pairing is disabled. Host pairing lets the administrator control which devices an iOS 7 device can pair with.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowLockScreenNotificationsView</string>
			<key>pfm_title</key>
			<string>Allow notifications to be displayed on the lock screen</string>
			<key>pfm_description</key>
			<string>If set to false, the Notifications view in Notification Center on the lock screen is disabled and users can’t receive notifications when the screen is locked.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowLockScreenTodayView</string>
			<key>pfm_title</key>
			<string>Allow Today view on the lock screen</string>
			<key>pfm_description</key>
			<string>If set to false, the Today view in Notification Center on the lock screen is disabled.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowMultiplayerGaming</string>
			<key>pfm_title</key>
			<string>Allow Multiplayer Gaming</string>
			<key>pfm_description</key>
			<string>Allow multiplayer gaming</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowVideoConferencing</string>
			<key>pfm_title</key>
			<string>Allow Video Conferencing</string>
			<key>pfm_description</key>
			<string>Allow video conferencing</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowVoiceDialing</string>
			<key>pfm_title</key>
			<string>Allow Voice Dialing While Device is Locked</string>
			<key>pfm_description</key>
			<string>Allow voice dialing while device is locked</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowYouTube</string>
			<key>pfm_title</key>
			<string>Allow YouTube App (iOS 6)</string>
			<key>pfm_description</key>
			<string>When false, the YouTube application is disabled and its icon is removed from the Home screen.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_max</key>
			<string>5.9</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>forceEncryptedBackup</string>
			<key>pfm_title</key>
			<string>Force Encrypted Backups</string>
			<key>pfm_description</key>
			<string>Force encrypted backups</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>forceWatchWristDetection</string>
			<key>pfm_title</key>
			<string>Force Apple Watch Wrist Detection</string>
			<key>pfm_description</key>
			<string>Force Apple Watch wrist detection</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_ios_min</key>
			<string>8.2</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowPairedWatch</string>
			<key>pfm_title</key>
			<string>Allow Pairing With Apple Watch</string>
			<key>pfm_description</key>
			<string>If set to false, disables pairing with an Apple Watch. Any currently paired Apple Watch is unpaired and erased. Defaults to true.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowEraseContentAndSettings</string>
			<key>pfm_title</key>
			<string>Allow Erase All Content and Settings</string>
			<key>pfm_description</key>
			<string>Supervised only. If set to false, the user cannot choose the option &quot;Erase All Content and Settings&quot; in Settings &gt; General &gt; Reset</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowSpotlightInternetResults</string>
			<key>pfm_title</key>
			<string>Allow Internet results in Spotlight</string>
			<key>pfm_description</key>
			<string>If set to false, search results from the web will not be shown in Spotlight.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.11</string>
			<key>pfm_ios_min</key>
			<string>0.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudDocumentSync</string>
			<key>pfm_title</key>
			<string>Allow iCloud Document Sync</string>
			<key>pfm_description</key>
			<string>Allow document syncing with iCloud. When false, disables document and key-value syncing to iCloud.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.11</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudKeychainSync</string>
			<key>pfm_title</key>
			<string>Allow iCloud Keychain Sync</string>
			<key>pfm_description</key>
			<string>Allow iCloud Keychain Sync</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowUntrustedTLSPrompt</string>
			<key>pfm_title</key>
			<string>Allow user to accept untrusted TLS certificates</string>
			<key>pfm_description</key>
			<string>Allow user to accept untrusted TLS certificates</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>5.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowDiagnosticSubmission</string>
			<key>pfm_title</key>
			<string>Allow diagnostic submission</string>
			<key>pfm_description</key>
			<string>Send diagnostic and usage reports to Apple</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_ios_min</key>
			<string>6.0</string>
		</dict>
        <dict>
            <key>pfm_name</key>
            <string>allowDiagnosticSubmissionModification</string>
            <key>pfm_title</key>
            <string>Allow modifying diagnostics settings</string>
            <key>pfm_description</key>
            <string>If set to false, the diagnostic submission and app analytics settings in the Diagnostics &amp; Usage pane in Settings cannot be modified</string>
            <key>pfm_type</key>
            <string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.3.2</string>
        </dict>
		<dict>
			<key>pfm_name</key>
			<string>allowPhotoStream</string>
			<key>pfm_title</key>
			<string>Allow Photo Stream</string>
			<key>pfm_description</key>
			<string>Allow Photo Stream to be used on the device</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>5.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudPhotoLibrary</string>
			<key>pfm_title</key>
			<string>Allow iCloud Photo Library</string>
			<key>pfm_description</key>
			<string>Allow iCloud Photo Library to be used on the device</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.0</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudBackup</string>
			<key>pfm_title</key>
			<string>Allow iCloud Backup</string>
			<key>pfm_description</key>
			<string>Allow backup using iCloud</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>5.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudBTMM</string>
			<key>pfm_title</key>
			<string>Allow iCloud Back to my Mac</string>
			<key>pfm_description</key>
			<string>Allow iCloud Back to my Mac</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.12</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudFMM</string>
			<key>pfm_title</key>
			<string>Allow iCloud Find my Mac</string>
			<key>pfm_description</key>
			<string>Allow iCloud Find my Mac</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.12</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudBookmarks</string>
			<key>pfm_title</key>
			<string>Allow macOS iCloud Bookmark Sync</string>
			<key>pfm_description</key>
			<string>Allow macOS iCloud Bookmark Sync</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.12</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudMail</string>
			<key>pfm_title</key>
			<string>Allow macOS iCloud Mail Services</string>
			<key>pfm_description</key>
			<string>Allow macOS iCloud Mail Services</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.12</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudCalendar</string>
			<key>pfm_title</key>
			<string>Allow macOS iCloud Calendar Services</string>
			<key>pfm_description</key>
			<string>Allow macOS iCloud Calendar Services</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.12</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudReminders</string>
			<key>pfm_title</key>
			<string>Allow macOS iCloud Reminder Services</string>
			<key>pfm_description</key>
			<string>Allow macOS iCloud Reminder Services</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.12</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudAddressBook</string>
			<key>pfm_title</key>
			<string>Allow macOS iCloud Address Book Services</string>
			<key>pfm_description</key>
			<string>Allow macOS iCloud Address Book Services</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.12</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudNotes</string>
			<key>pfm_title</key>
			<string>Allow macOS iCloud Notes Services</string>
			<key>pfm_description</key>
			<string>Allow macOS iCloud Notes Services</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.12</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>forceITunesStorePasswordEntry</string>
			<key>pfm_title</key>
			<string>Require iTunes password for all purchases</string>
			<key>pfm_description</key>
			<string>Require the user&apos;s iTunes password to be entered for every purchase</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_ios_min</key>
			<string>5.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>forceLimitAdTracking</string>
			<key>pfm_title</key>
			<string>Limit Ad Tracking</string>
			<key>pfm_description</key>
			<string>If true, limits ad tracking. Default is false.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>forceAirPlayOutgoingRequestsPairingPassword</string>
			<key>pfm_title</key>
			<string>AirPlay requests must use a pairing password</string>
			<key>pfm_description</key>
			<string>If set to true, forces all devices receiving AirPlay requests from this device to use a pairing password.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_ios_min</key>
			<string>7.1</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>forceAirPlayIncomingRequestsPairingPassword</string>
			<key>pfm_title</key>
			<string>AirPlay requests incoming must use a pairing password</string>
			<key>pfm_description</key>
			<string>If set to true, forces all devices sending AirPlay requests to this device to use a pairing password.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_tvos_min</key>
			<string>6.1</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ratingApps</string>
			<key>pfm_title</key>
			<string>Apps Ranking Number</string>
			<key>pfm_description</key>
			<string>Ranking number for apps</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>1000</integer>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ratingMovies</string>
			<key>pfm_title</key>
			<string>Movies Ranking Number</string>
			<key>pfm_description</key>
			<string>Ranking number for movies</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>1000</integer>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ratingTVShows</string>
			<key>pfm_title</key>
			<string>TV Shows Ranking Number</string>
			<key>pfm_description</key>
			<string>Ranking number for TV Shows</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>1000</integer>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ratingRegion</string>
			<key>pfm_title</key>
			<string>Region Code</string>
			<key>pfm_description</key>
			<string>Two-character code for the region used to specify ratings</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_range_list</key>
			<array>
				<string>us</string>
				<string>au</string>
				<string>ca</string>
				<string>de</string>
				<string>fr</string>
				<string>ie</string>
				<string>jp</string>
				<string>nz</string>
				<string>gb</string>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>safariAcceptCookies</string>
			<key>pfm_title</key>
			<string>Accept Cookies in Safari</string>
			<key>pfm_description</key>
			<string>Accept cookies: 0 - Never, 1 - From current website only (iOS 8) or visited sites (pre-iOS 8), 1.5 - From websites I visit, 2 - Always</string>
			<key>pfm_type</key>
			<string>real</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<real>1.5</real>
				<integer>2</integer>
			</array>
			<key>pfm_default</key>
			<integer>2</integer>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>safariAllowAutoFill</string>
			<key>pfm_title</key>
			<string>Allow AutoFill in Safari</string>
			<key>pfm_description</key>
			<string>Allow AutoFill in Safari</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>safariAllowJavaScript</string>
			<key>pfm_title</key>
			<string>Allow JavaScript</string>
			<key>pfm_description</key>
			<string>Allow JavaScript in Safari</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>safariAllowPopups</string>
			<key>pfm_title</key>
			<string>Allow Pop-ups</string>
			<key>pfm_description</key>
			<string>Allow Pop-ups in Safari</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>safariForceFraudWarning</string>
			<key>pfm_title</key>
			<string>Enable Fraud Warning</string>
			<key>pfm_description</key>
			<string>Enable fraud warning in Safari</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowAssistant</string>
			<key>pfm_title</key>
			<string>Allow Siri</string>
			<key>pfm_description</key>
			<string>Allow Siri</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowAssistantUserGeneratedContent</string>
			<key>pfm_title</key>
			<string>When false, prevents Siri from querying user-generated content from the web.</string>
			<key>pfm_description</key>
			<string>When false, prevents Siri from querying user-generated content from the web.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowAssistantWhileLocked</string>
			<key>pfm_title</key>
			<string>Allow Siri While Locked</string>
			<key>pfm_description</key>
			<string>Allow Siri while device is locked</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>5.1</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>forceAssistantProfanityFilter</string>
			<key>pfm_title</key>
			<string>Enable Siri Profanity Filter</string>
			<key>pfm_description</key>
			<string>Enable Siri Profanity Filter (Supervised devices only)</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_supervised</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowPredictiveKeyboard</string>
			<key>pfm_title</key>
			<string>Allow Predictive Keyboard</string>
			<key>pfm_description</key>
			<string>Allow Predictive Keyboard (Supervised devices only)</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>8.1.3</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowKeyboardShortcuts</string>
			<key>pfm_title</key>
			<string>Allow Keyboard Shortcuts</string>
			<key>pfm_description</key>
			<string>Allow Keyboard Shortcuts (Supervised devices only)</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowAutoCorrection</string>
			<key>pfm_title</key>
			<string>Allow Auto Correction</string>
			<key>pfm_description</key>
			<string>Allow Auto Correction (Supervised devices only)</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>8.1.3</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowSpellCheck</string>
			<key>pfm_title</key>
			<string>Allow Spell Check</string>
			<key>pfm_description</key>
			<string>Allow Spell Check (Supervised devices only)</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>8.1.3</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowDefinitionLookup</string>
			<key>pfm_title</key>
			<string>Allow Define</string>
			<key>pfm_description</key>
			<string>Allow Define (Supervised devices only)</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>8.1.3</string>
			<key>pfm_macos_min</key>
			<string>10.11.2</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowOpenFromUnmanagedToManaged</string>
			<key>pfm_title</key>
			<string>Enable allow open from unmanaged to managed</string>
			<key>pfm_description</key>
			<string>Enable allow open from unmanaged to managed</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowOpenFromManagedToUnmanaged</string>
			<key>pfm_title</key>
			<string>Enable allow open from managed to unmanaged</string>
			<key>pfm_description</key>
			<string>Enable allow open from managed to unmanaged</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowOTAPKIUpdates</string>
			<key>pfm_title</key>
			<string>Allow PKI Updates OTA</string>
			<key>pfm_description</key>
			<string>If false, over-the-air PKI updates are disabled. Setting this restriction to false does not disable CRL and OCSP checks. Default is true.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>forceAirDropUnmanaged</string>
			<key>pfm_title</key>
			<string>Treat AirDrop as Unmanaged Destination</string>
			<key>pfm_description</key>
			<string>Treat AirDrop as Unmanaged Destination</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_ios_min</key>
			<string>9.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowActivityContinuation</string>
			<key>pfm_title</key>
			<string>Allow Handoff</string>
			<key>pfm_description</key>
			<string>If set to false, Handoff will be disabled.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowFingerprintForUnlock</string>
			<key>pfm_title</key>
			<string>Allow Touch ID to Unlock Device</string>
			<key>pfm_description</key>
			<string>Allow Touch ID to Unlock Device</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.12.4</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowFingerprintModification</string>
			<key>pfm_title</key>
			<string>Allow Modifying Touch ID Fingerprints</string>
			<key>pfm_description</key>
			<string>Allow modifying Touch ID fingerprints</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
        <dict>
            <key>pfm_name</key>
            <string>allowNotificationsModification</string>
            <key>pfm_title</key>
            <string>Allow Modifying Notifications Settings</string>
            <key>pfm_description</key>
            <string>Allow Modifying Notifications Settings</string>
            <key>pfm_type</key>
            <string>boolean</string>
            <key>pfm_default</key>
            <true/>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.3</string>
        </dict>
        <dict>
            <key>pfm_name</key>
            <string>blacklistedAppBundleIDs</string>
            <key>pfm_title</key>
            <string>Blacklisted Apps</string>
            <key>pfm_description</key>
            <string>If present, prevents bundle IDs listed in the array from being shown or launchable.</string>
            <key>pfm_type</key>
            <string>array</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.3</string>
            <key>pfm_subkeys</key>
            <array>
                <dict>
                    <key>pfm_name</key>
                    <string>appBundleID</string>
                    <key>pfm_title</key>
                    <string>Blacklisted App</string>
                    <key>pfm_description</key>
                    <string>Blacklisted App</string>
                    <key>pfm_type</key>
                    <string>string</string>
                    <key>pfm_default</key>
                    <string/>
                </dict>
            </array>
        </dict>
        <dict>
            <key>pfm_name</key>
            <string>whitelistedAppBundleIDs</string>
            <key>pfm_title</key>
            <string>Whitelisted Apps</string>
            <key>pfm_description</key>
            <string>If present, allows only bundle IDs listed in the array from being shown or launchable.</string>
            <key>pfm_type</key>
            <string>array</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_ios_min</key>
			<string>9.3</string>
            <key>pfm_subkeys</key>
            <array>
                <dict>
                    <key>pfm_name</key>
                    <string>appBundleID</string>
                    <key>pfm_title</key>
                    <string>Whitelisted App</string>
                    <key>pfm_description</key>
                    <string>Whitelisted App</string>
                    <key>pfm_type</key>
                    <string>string</string>
                    <key>pfm_default</key>
                    <string/>
                </dict>
            </array>
        </dict>
		<dict>
			<key>pfm_name</key>
			<string>allowAutoUnlock</string>
			<key>pfm_title</key>
			<string>Allow macOS auto unlock</string>
			<key>pfm_description</key>
			<string>If set to false, disallows macOS auto unlock. Defaults to true.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.12</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>allowCloudDesktopAndDocuments</string>
			<key>pfm_title</key>
			<string>Allow cloud desktop and documents</string>
			<key>pfm_description</key>
			<string>If set to false, disallows macOS cloud desktop and document services. Defaults to true.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.12.4</string>
		</dict>
    </array>
</dict>
</plist>
