<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>ShareKit Payload</string>
        <key>pfm_title</key>
        <string>ShareKit Payload</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.com.apple.ShareKitHelper</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Payload Description</string>
                <key>pfm_description</key>
                <string>Description of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>ShareKit Payload</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
                <key>pfm_description</key>
                <string>Name of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>ShareKit Payload</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
                <key>pfm_description</key>
                <string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.com.apple.ShareKitHelper</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
                <key>pfm_description</key>
                <string>The type of the payload, a reverse dns string</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.com.apple.ShareKitHelper</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
                <key>pfm_description</key>
                <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string></string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
                <key>pfm_description</key>
                <string>The version of the whole configuration profile.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
                <key>pfm_description</key>
                <string>This value describes the issuing organization of the profile, as displayed to the user</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>SHKAllowedShareServices</string>
                <key>pfm_title</key>
                <string>Permitted Share Items</string>
                <key>pfm_description</key>
                <string>List of plugin IDs that will show up in the user’s Share menu. If this array exists then only these items will be permitted.</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>SHKAllowedShareServicesItem</string>
                        <key>pfm_title</key>
                        <string>Allowed Plugin ID Item</string>
                        <key>pfm_description</key>
                        <string>Allowed Plugin ID Item</string>
                        <key>pfm_type</key>
                        <string>string</string>
                        <key>pfm_range_list</key>
                        <array>
                            <string>com.apple.share.AirDrop</string>
                            <string>com.apple.share.Facebook</string>
                            <string>com.apple.share.Twitter</string>
                            <string>com.apple.share.Mail</string>
                            <string>com.apple.share.Messages</string>
                            <string>com.apple.share.Video</string>
                            <string>com.apple.share.addtoiphoto</string>
                            <string>com.apple.share.addtoaperture</string>
                            <string>com.apple.share.readlater</string>
                            <string>com.apple.share.SinaWeibo</string>
                            <string>com.apple.Notes.SharingExtension</string>
                            <string>com.apple.reminders.RemindersShareExtension</string>
                            <string>com.apple.share.LinkedIn.post</string>
                        </array>
                    </dict>
                </array>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>SHKDeniedShareServices</string>
                <key>pfm_title</key>
                <string>Denied Share Items</string>
                <key>pfm_description</key>
                <string>List of plugin IDs that will not show up in the user’s Share menu. This key is used only if there is no SHKAllowedShareServices key.</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>SHKDeniedShareServicesItem</string>
                        <key>pfm_title</key>
                        <string>Denied Plugin ID Item</string>
                        <key>pfm_description</key>
                        <string>Denied Plugin ID Item</string>
                        <key>pfm_type</key>
                        <string>string</string>
                        <key>pfm_range_list</key>
                        <array>
                            <string>com.apple.share.AirDrop</string>
                            <string>com.apple.share.Facebook</string>
                            <string>com.apple.share.Twitter</string>
                            <string>com.apple.share.Mail</string>
                            <string>com.apple.share.Messages</string>
                            <string>com.apple.share.Video</string>
                            <string>com.apple.share.addtoiphoto</string>
                            <string>com.apple.share.addtoaperture</string>
                            <string>com.apple.share.readlater</string>
                            <string>com.apple.share.SinaWeibo</string>
                            <string>com.apple.Notes.SharingExtension</string>
                            <string>com.apple.reminders.RemindersShareExtension</string>
                            <string>com.apple.share.LinkedIn.post</string>
                        </array>
                    </dict>
                </array>
            </dict>
        </array>
    </dict>
</plist>
