<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Configures notifications settings for apps</string>
	<key>pfm_title</key>
	<string>Notifications</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_version</key>
	<integer>1</integer>
	<key>pfm_domain</key>
	<string>com.apple.notificationsettings</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_supervised</key>
	<true/>
	<key>pfm_ios_min</key>
	<string>9.3</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>Configures notifications settings for apps</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>Notifications</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.notificationsettings</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.notificationsettings</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>NotificationSettings</string>
			<key>pfm_title</key>
			<string>Notification Settings</string>
			<key>pfm_description</key>
			<string>Notification settings for each app</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>NotificationSetting</string>
					<key>pfm_title</key>
					<string>Notification Setting</string>
					<key>pfm_description</key>
					<string>Notification settings for an app</string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>BundleIdentifier</string>
							<key>pfm_title</key>
							<string>App Bundle Identifier</string>
							<key>pfm_description</key>
							<string>Bundle identifier of the target app</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_required</key>
							<true/>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>NotificationsEnabled</string>
							<key>pfm_title</key>
							<string>Enable Notifications</string>
							<key>pfm_description</key>
							<string>Whether notifications are allowed for this app.</string>
							<key>pfm_type</key>
							<string>boolean</string>
							<key>pfm_default</key>
							<true/>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>ShowInNotificationCenter</string>
							<key>pfm_title</key>
							<string>Show in Notification Center</string>
							<key>pfm_description</key>
							<string>Whether notifications can be shown in notification center.</string>
							<key>pfm_type</key>
							<string>boolean</string>
							<key>pfm_default</key>
							<true/>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>ShowInLockScreen</string>
							<key>pfm_title</key>
							<string>Show in Lock Screen</string>
							<key>pfm_description</key>
							<string>Whether notifications can be shown in the lock screen.</string>
							<key>pfm_type</key>
							<string>boolean</string>
							<key>pfm_default</key>
							<true/>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>AlertType</string>
							<key>pfm_title</key>
							<string>Alert Type</string>
							<key>pfm_description</key>
							<string>The type of alert for notifications for this app. None/Banner/Alert</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_default</key>
							<integer>1</integer>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>BadgesEnabled</string>
							<key>pfm_title</key>
							<string>Badges Enabled</string>
							<key>pfm_description</key>
							<string>Whether badges are allowed for this app.</string>
							<key>pfm_type</key>
							<string>boolean</string>
							<key>pfm_default</key>
							<true/>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>SoundsEnabled</string>
							<key>pfm_title</key>
							<string>Sounds Enabled</string>
							<key>pfm_description</key>
							<string>Whether sounds are allowed for this app.</string>
							<key>pfm_type</key>
							<string>boolean</string>
							<key>pfm_default</key>
							<true/>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
	</array>
</dict>
</plist>
