<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Dashboard preferences.</string>
	<key>pfm_domain</key>
	<string>com.apple.dashboard</string>
	<key>pfm_name</key>
	<string>dashboard</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_name</key>
			<string>whiteListEnabled</string>
			<key>pfm_title</key>
			<string>Enable dashboard widget whitelist</string>
			<key>pfm_description</key>
			<string>Required. Set to true to enable the widget white list items.</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>whiteList</string>
			<key>pfm_title</key>
			<string>Dashboard widget whitelist</string>
			<key>pfm_description</key>
			<string>Required. List that defines Dashboard widgets.</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>Type</string>
					<key>pfm_title</key>
					<string>Entry Type</string>
					<key>pfm_description</key>
					<string>Required. Set to "bundleID" to use a widget’s bundle ID as its ID.</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_require</key>
					<string>always</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ID</string>
					<key>pfm_title</key>
					<string>Widget bundle ID</string>
					<key>pfm_description</key>
					<string>Required. The bundle ID of a widget.</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_require</key>
					<string>always</string>
				</dict>
			</array>
		</dict>
	</array>
	<key>pfm_title</key>
	<string>Dashboard</string>
	<key>pfm_version</key>
	<real>1</real>
</dict>
</plist>
