<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>Sleep and screen saver password.</string>
        <key>pfm_domain</key>
        <string>com.apple.screensaver</string>
        <key>pfm_name</key>
        <string>screensaver</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_default</key>
                <integer>1200</integer>
                <key>pfm_description</key>
                <string>Idle time in seconds. Default is 20 minutes (1200 seonds). Set to 0 to disable screensaver.</string>
                <key>pfm_name</key>
                <string>loginWindowIdleTime</string>
                <key>pfm_targets</key>
                <array>
                    <string>system-managed</string>
                </array>
                <key>pfm_title</key>
                <string>Login Window Screen Saver Idle Time</string>
                <key>pfm_type</key>
                <string>integer</string>
            </dict>
            <dict>
                <key>pfm_default</key>
                <integer>300</integer>
                <key>pfm_description</key>
                <string>Idle time in seconds. Default is 5 minutes (300 seonds). Set to 0 to disable screensaver.</string>
                <key>pfm_name</key>
                <string>idleTime</string>
                <key>pfm_targets</key>
                <array>
                    <string>system-managed</string>
                </array>
                <key>pfm_title</key>
                <string>Screen Saver Idle Time</string>
                <key>pfm_type</key>
                <string>integer</string>
            </dict>
            <dict>
                <key>pfm_default</key>
                <string>/System/Library/Screen Savers/Flurry.saver</string>
                <key>pfm_description</key>
                <string>Path to screen saver module. Note that not all screen savers will work before login. These may include any feed\, random\, shuffle or non-Apple codesigned screensavers.</string>
                <key>pfm_name</key>
                <string>loginWindowModulePath</string>
                <key>pfm_targets</key>
                <array>
                    <string>system-managed</string>
                </array>
                <key>pfm_title</key>
                <string>Screen Saver Module Path</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_default</key>
                <integer>0</integer>
                <key>pfm_description</key>
                <string>Require password to wake from sleep or screen saver. Set to 1 to require a password. Set to 0 to not require a password.</string>
                <key>pfm_name</key>
                <string>askForPassword</string>
                <key>pfm_range_list</key>
                <array>
                    <integer>0</integer>
                    <integer>1</integer>
                </array>
                <key>pfm_targets</key>
                <array>
                    <string>user</string>
                    <string>user-managed</string>
                </array>
                <key>pfm_title</key>
                <string>Require Password</string>
                <key>pfm_type</key>
                <string>integer</string>
            </dict>
        </array>
        <key>pfm_title</key>
        <string>Screen Saver Loginwindow</string>
        <key>pfm_version</key>
        <real>2.1</real>
    </dict>
</plist>