<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>Use this section to define restrictions settings</string>
        <key>pfm_title</key>
        <string>Restrictions (new)</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.applicationaccess.new</string>
        <key>pfm_note</key>
        <string>Seems to be an add on to applicationaccess for parental controls</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Payload Description</string>
                <key>pfm_description</key>
                <string>Description of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Configures restrictions (new)</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
                <key>pfm_description</key>
                <string>Name of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Restrictions (new)</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
                <key>pfm_description</key>
                <string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.applicationaccess.new</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
                <key>pfm_description</key>
                <string>The type of the payload, a reverse dns string</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.applicationaccess.new</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
                <key>pfm_description</key>
                <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string></string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
                <key>pfm_description</key>
                <string>The version of the whole configuration profile.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
                <key>pfm_description</key>
                <string>This value describes the issuing organization of the profile, as displayed to the user</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>familyControlsEnabled</string>
                <key>pfm_title</key>
                <string></string>
                <key>pfm_description</key>
                <string></string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>whiteList</string>
                <key>pfm_title</key>
                <string>Application Whitelist</string>
                <key>pfm_description</key>
                <string>Application Whitelist</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>whiteListItem</string>
                        <key>pfm_type</key>
                        <string>dict</string>
                        <key>pfm_title</key>
                        <string>Whitelisted Item</string>
                        <key>pfm_description</key>
                        <string>Seems to be a dict type but needs verification, whitelist by app name</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>displayName</string>
                                <key>pfm_title</key>
                                <string>Application Display Name</string>
                                <key>pfm_description</key>
                                <string>The display name of an application to whitelist</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                        </array>
                    </dict>
                </array>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>pathWhiteList</string>
                <key>pfm_title</key>
                <string>Whitelisted Applications By Path</string>
                <key>pfm_description</key>
                <string>The listed paths are whitelisted for application launch</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>pathWhiteListItem</string>
                        <key>pfm_type</key>
                        <string>string</string>
                        <key>pfm_title</key>
                        <string>Whitelisted Path Item</string>
                        <key>pfm_description</key>
                        <string>The absolute path to an app bundle to whitelist</string>
                    </dict>
                </array>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>pathBlackList</string>
                <key>pfm_title</key>
                <string>Blacklisted Applications By Path</string>
                <key>pfm_description</key>
                <string>The listed paths are blacklisted for application launch</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>pathBlackListItem</string>
                        <key>pfm_type</key>
                        <string>string</string>
                        <key>pfm_title</key>
                        <string>Blacklisted Path Item</string>
                        <key>pfm_description</key>
                        <string>The absolute path to an app bundle to blacklist</string>
                    </dict>
                </array>
            </dict>
        </array>
    </dict>
</plist>
