<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define settings for configuration access to SCEP servers.</string>
	<key>pfm_title</key>
	<string>SCEP</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_version</key>
	<integer>1</integer>
	<key>pfm_domain</key>
	<string>com.apple.security.scep</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>Configures SCEP settings</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>SCEP</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.security.scep</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.security.scep</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadContent</string>
			<key>pfm_title</key>
			<string>Payload Content</string>
			<key>pfm_description</key>
			<string>This dictionary contains the payload contents</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_default</key>
			<dict>
				<key>Key Type</key>
				<string>RSA</string>
				<key>Keysize</key>
				<integer>1024</integer>
				<key>Retries</key>
				<integer>3</integer>
				<key>RetryDelay</key>
				<integer>10</integer>
			</dict>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>URL</string>
					<key>pfm_title</key>
					<string>URL</string>
					<key>pfm_description</key>
					<string>The base URL for the SCEP server</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_require</key>
					<string>always</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>Name</string>
					<key>pfm_title</key>
					<string>Name</string>
					<key>pfm_description</key>
					<string>The name of the instance: CA-IDENT</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>Subject</string>
					<key>pfm_title</key>
					<string>Subject</string>
					<key>pfm_description</key>
					<string>Representation of a X.500 name</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>SCEPSubjectArrayInnerArray</string>
							<key>pfm_title</key>
							<string>Array Inside SCEP Subject Array</string>
							<key>pfm_description</key>
							<string>This array holds another array which holds an OID value pair</string>
							<key>pfm_type</key>
							<string>array</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>SCEPSubjectArrayPair</string>
									<key>pfm_title</key>
									<string>Subject Array Pair</string>
									<key>pfm_description</key>
									<string>An array representing an OID and value pair.</string>
									<key>pfm_type</key>
									<string>array</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>SCEPSubjectArrayPairItem</string>
											<key>pfm_title</key>
											<string>SCEP Subject Array Pair Item</string>
											<key>pfm_description</key>
											<string>One item in the array representing a pair of OID and value</string>
											<key>pfm_type</key>
											<string>string</string>
											<key>pfm_repetition_min</key>
											<integer>2</integer>
											<key>pfm_repetition_max</key>
											<integer>2</integer>
										</dict>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>Challenge</string>
					<key>pfm_title</key>
					<string>Challenge</string>
					<key>pfm_description</key>
					<string>Used as the pre-shared secret for automatic enrollment</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>Keysize</string>
					<key>pfm_title</key>
					<string>Key Size</string>
					<key>pfm_description</key>
					<string>Key size in bits</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_default</key>
					<integer>1024</integer>
					<key>pfm_range_list</key>
					<array>
						<integer>1024</integer>
						<integer>2048</integer>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>CAFingerprint</string>
					<key>pfm_title</key>
					<string>Fingerprint</string>
					<key>pfm_description</key>
					<string>Enter hex string to be used as a fingerprint or create fingerprint from Certificate</string>
					<key>pfm_type</key>
					<string>data</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>KeyType</string>
					<key>pfm_title</key>
					<string>Key Type</string>
					<key>pfm_description</key>
					<string>Key Type</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>RSA</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>KeyUsage</string>
					<key>pfm_title</key>
					<string>Key Usage</string>
					<key>pfm_description</key>
					<string>A bitmask indicating the use of the ky. 1 - signing, 4 - encryption, 5 - signing and encryption</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_ios_min</key>
					<string>4.0</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>SubjectAltName</string>
					<key>pfm_title</key>
					<string>Subject Alt Name</string>
					<key>pfm_description</key>
					<string>Specifies the Subject Alt Name for the certificate</string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>rfc822Name</string>
							<key>pfm_title</key>
							<string>RFC 822 Name</string>
							<key>pfm_description</key>
							<string>RFC 822 (email address) string</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>dNSName</string>
							<key>pfm_title</key>
							<string>DNS Name</string>
							<key>pfm_description</key>
							<string>DNS Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>uniformResourceIdentifier</string>
							<key>pfm_title</key>
							<string>URI</string>
							<key>pfm_description</key>
							<string>Uniform Resource Indentifier</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>ntPrincipalName</string>
							<key>pfm_title</key>
							<string>NT Principal Name</string>
							<key>pfm_description</key>
							<string>NT Principal Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>Retries</string>
					<key>pfm_title</key>
					<string>Retries</string>
					<key>pfm_description</key>
					<string>The number of times the device should retry if the server sends a PENDING response</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_default</key>
					<integer>3</integer>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>RetryDelay</string>
					<key>pfm_title</key>
					<string>Retry Delay</string>
					<key>pfm_description</key>
					<string>The number of seconds to wait between subsequent retries. The first retry is attempted without this delay</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_default</key>
					<integer>10</integer>
				</dict>
			</array>
		</dict>
	</array>
</dict>
</plist>
