<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define settings for VPN access.</string>
	<key>pfm_title</key>
	<string>VPN</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_version</key>
	<integer>1</integer>
	<key>pfm_domain</key>
	<string>com.apple.vpn.managed</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>Configures VPN settings</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>VPN</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.vpn.managed</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.vpn.managed</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>UserDefinedName</string>
			<key>pfm_title</key>
			<string>User Defined Name</string>
			<key>pfm_description</key>
			<string>Description of the VPN connection displayed on the device</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>VPNType</string>
			<key>pfm_title</key>
			<string>Type</string>
			<key>pfm_description</key>
			<string>Determines the settings available for this VPN payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>L2TP</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_range_list</key>
			<array>
				<string>L2TP</string>
				<string>PPTP</string>
				<string>IPSec</string>
				<string>VPN</string>
				<string>IKEv2</string>
				<string>AlwaysOn</string>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>VPNSubType</string>
			<key>pfm_title</key>
			<string>VPN Subtype</string>
			<key>pfm_description</key>
			<string>If VPNType is &quot;VPN&quot; this field will be an identifier for a vendor specified configuration dictionary</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>VPNType</string>
							<key>pfm_range_list</key>
							<array>
								<string>VPN</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>VPNType</string>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>VendorConfig</string>
			<key>pfm_title</key>
			<string>Vendor Configuration Dictionary</string>
			<key>pfm_description</key>
			<string>A vendor specific configuration dictionary</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_default</key>
			<dict/>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>Realm</string>
					<key>pfm_title</key>
					<string>Realm</string>
					<key>pfm_description</key>
					<string>Realm to connect to on the server</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNSubType</string>
									<key>pfm_present</key>
									<true/>
									<key>pfm_range_list</key>
									<array>
										<string>net.juniper.sslvpn</string>
										<string>net.pulsesecure.PulseSecure.vpnplugin</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>Role</string>
					<key>pfm_title</key>
					<string>Role</string>
					<key>pfm_description</key>
					<string>Role to select when connecting to the server. Valid only for Juniper SSL</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNSubType</string>
									<key>pfm_present</key>
									<true/>
									<key>pfm_range_list</key>
									<array>
										<string>net.juniper.sslvpn</string>
										<string>net.pulsesecure.PulseSecure.vpnplugin</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNSubType</string>
									<key>pfm_present</key>
									<true/>
									<key>pfm_n_range_list</key>
									<array>
										<string>net.juniper.sslvpn</string>
										<string>net.pulsesecure.PulseSecure.vpnplugin</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>Group</string>
					<key>pfm_title</key>
					<string>Group</string>
					<key>pfm_description</key>
					<string>Group to connect to on the head end. Valid only for Cisco AnyConnect</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNSubType</string>
									<key>pfm_present</key>
									<true/>
									<key>pfm_range_list</key>
									<array>
										<string>com.cisco.anyconnect.applevpn.plugin</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>LoginGroupOrDomain</string>
					<key>pfm_title</key>
					<string>Login Group or Domain</string>
					<key>pfm_description</key>
					<string>Login Group or Domain</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNSubType</string>
									<key>pfm_present</key>
									<true/>
									<key>pfm_range_list</key>
									<array>
										<string>com.sonicwall.SonicWALL-SSLVPN.vpnplugin</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>VPNType</string>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>Proxies</string>
			<key>pfm_title</key>
			<string>Proxies</string>
			<key>pfm_description</key>
			<string>Proxies</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_default</key>
			<dict>
				<key>HTTPEnable</key>
				<integer>0</integer>
				<key>HTTPSEnable</key>
				<integer>0</integer>
			</dict>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>HTTPEnable</string>
					<key>pfm_title</key>
					<string>Enable HTTP</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>HTTPPort</string>
					<key>pfm_title</key>
					<string>HTTP Port</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_range_max</key>
					<integer>65535</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
									<key>pfm_contains_any</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>HTTPProxy</string>
					<key>pfm_title</key>
					<string>HTTP Proxy</string>
					<key>pfm_description</key>
					<string>Proxy URL</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>HTTPProxyPassword</string>
					<key>pfm_title</key>
					<string>HTTP ProxyPassword</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>HTTPProxyUsername</string>
					<key>pfm_title</key>
					<string>HTTP ProxyUsername</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
									<key>pfm_contains_any</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>HTTPSEnable</string>
					<key>pfm_title</key>
					<string>Enable HTTPS</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>HTTPSPort</string>
					<key>pfm_title</key>
					<string>HTTPS Port</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_range_max</key>
					<integer>65535</integer>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
									<key>pfm_contains_any</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>HTTPSProxy</string>
					<key>pfm_title</key>
					<string>HTTPS Proxy</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ProxyAutoConfigEnable</string>
					<key>pfm_title</key>
					<string>Proxy AutoConfig Enable</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ProxyAutoDiscoveryEnable</string>
					<key>pfm_title</key>
					<string>Proxy Auto Discovery Enable</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoConfigEnable</string>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
								<dict>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoConfigURLString</string>
									<key>pfm_present</key>
									<true/>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ProxyAutoConfigURLString</string>
					<key>pfm_title</key>
					<string>Proxy Server URL</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoConfigEnable</string>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>VPN</string>
			<key>pfm_title</key>
			<string>VPN</string>
			<key>pfm_description</key>
			<string>VPN Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_default</key>
			<dict>
				<key>AuthenticationMethod</key>
				<string>Password</string>
			</dict>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>AuthName</string>
					<key>pfm_title</key>
					<string>Account Username</string>
					<key>pfm_description</key>
					<string>The VPN account username</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_range_list</key>
									<array>
										<string>VPN</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>AuthPassword</string>
					<key>pfm_title</key>
					<string>Account Password</string>
					<key>pfm_description</key>
					<string>The VPN user password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_title</key>
					<string>Authentication Method</string>
					<key>pfm_description</key>
					<string>Authentication method. Either shared secret or certificate</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_range_list</key>
									<array>
										<string>VPN</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_range_list</key>
					<array>
						<string>Password</string>
						<string>Certificate</string>
						<string>Password+Certificate</string>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>Certificate UUID</string>
					<key>pfm_description</key>
					<string>The UUID of the certificate to use for account credentials</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_range_list</key>
									<array>
										<string>VPN</string>
									</array>
								</dict>
								<dict>
									<key>pfm_target</key>
									<string>VPN.AuthenticationMethod</string>
									<key>pfm_range_list</key>
									<array>
										<string>Password+Certificate</string>
										<string>Certificate</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>OnDemandEnabled</string>
					<key>pfm_title</key>
					<string>Enable VPN On Demand</string>
					<key>pfm_description</key>
					<string>Enable VPN On Demand</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsAlways</string>
					<key>pfm_title</key>
					<string>On Demand Match Domains Always</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainAlwaysElement</string>
							<key>pfm_title</key>
							<string>Match Domain Always Element</string>
							<key>pfm_description</key>
							<string>Match domain or host</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsNever</string>
					<key>pfm_title</key>
					<string>On Demand Match Domains Never</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainNeverElement</string>
							<key>pfm_title</key>
							<string>Match Domain Never Element</string>
							<key>pfm_description</key>
							<string>Match domain or host</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsOnRetry</string>
					<key>pfm_title</key>
					<string>On Demand Match Domains On Retry</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainOnRetryElement</string>
							<key>pfm_title</key>
							<string>Match Domain On Retry Element</string>
							<key>pfm_description</key>
							<string>Match domain or host</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>OnDemandRules</string>
					<key>pfm_title</key>
					<string>On Demand Rules</string>
					<key>pfm_description</key>
					<string>An array of dictionaries defining On Demand Rules</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>OnDemandRulesElement</string>
							<key>pfm_title</key>
							<string>On Demand Rules Element</string>
							<key>pfm_description</key>
							<string>An On Demand rule</string>
							<key>pfm_type</key>
							<string>dictionary</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>DNSDomainMatch</string>
									<key>pfm_title</key>
									<string>DNS Domain Match</string>
									<key>pfm_description</key>
									<string>An array of DNS addresses</string>
									<key>pfm_type</key>
									<string>array</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSDomainMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Domain Match Element</string>
											<key>pfm_description</key>
											<string>A DNS address. May include wildcards</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>DNSServerAddressMatch</string>
									<key>pfm_title</key>
									<string>DNS Server Address Match</string>
									<key>pfm_description</key>
									<string>An array of DNS Server Addresses</string>
									<key>pfm_type</key>
									<string>array</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSServerAddressMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Server Address Match Element</string>
											<key>pfm_description</key>
											<string>A DNS server address. May include wildcards</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>URLStringProbe</string>
									<key>pfm_title</key>
									<string>URL String Probe</string>
									<key>pfm_description</key>
									<string>A test URL</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_title</key>
									<string>On Demand Action</string>
									<key>pfm_description</key>
									<string>On Demand Action</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Ignore</string>
										<string>Connect</string>
										<string>Disconnect</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_description</key>
					<string>Disconnect after an on demand connection idles</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPN.OnDemandEnabled</string>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_title</key>
					<string>Disconnect on Idle time</string>
					<key>pfm_description</key>
					<string>Length of time to wait before disconnecting an on demand connection</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPN.DisconnectOnIdle</string>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>RemoteAddress</string>
					<key>pfm_title</key>
					<string>Server</string>
					<key>pfm_description</key>
					<string>Hostname or IP address for server</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_range_list</key>
									<array>
										<string>VPN</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>VPNType</string>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PPP</string>
			<key>pfm_title</key>
			<string>PPP</string>
			<key>pfm_description</key>
			<string>PPP Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_default</key>
			<dict/>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>AuthName</string>
					<key>pfm_title</key>
					<string>Account Username</string>
					<key>pfm_description</key>
					<string>The VPN account username</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_range_list</key>
									<array>
										<string>PPTP</string>
										<string>L2TP</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>AuthPassword</string>
					<key>pfm_title</key>
					<string>Account Password</string>
					<key>pfm_description</key>
					<string>The VPN user password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>TokenCard</string>
					<key>pfm_title</key>
					<string>Use Token Card</string>
					<key>pfm_description</key>
					<string>Use a token card such as an RSA SecurID card for connecting</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>CommRemoteAddress</string>
					<key>pfm_title</key>
					<string>Remote Address</string>
					<key>pfm_description</key>
					<string>IP address or hostname of VPN server</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_range_list</key>
									<array>
										<string>PPTP</string>
										<string>L2TP</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>AuthEAPPlugins</string>
					<key>pfm_title</key>
					<string>EAP Plugins</string>
					<key>pfm_description</key>
					<string>Only present if RSA SecurID is being used, in which case it has one string entry: EAP-RSA</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>EAPPluginElement</string>
							<key>pfm_title</key>
							<string>EAP Plugin</string>
							<key>pfm_description</key>
							<string>String inside EAP Plugins array. If present, must be &quot;EAP-RSA&quot;</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_repetition_max</key>
							<integer>1</integer>
							<key>pfm_repetition_min</key>
							<integer>1</integer>
							<key>pfm_range_list</key>
							<array>
								<string>EAP-RSA</string>
								<string>EAP-TLS</string>
								<string>EAP-KRB</string>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>AuthProtocol</string>
					<key>pfm_title</key>
					<string>Protocol</string>
					<key>pfm_description</key>
					<string>Only present if RSA SecurID is being used, in which case it has one string entry: EAP</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>AuthProtocolElement</string>
							<key>pfm_title</key>
							<string>Auth Protocol</string>
							<key>pfm_description</key>
							<string>String inside Auth Protocol array. If present, must be &quot;EAP&quot;</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_repetition_max</key>
							<integer>1</integer>
							<key>pfm_repetition_min</key>
							<integer>1</integer>
							<key>pfm_range_list</key>
							<array>
								<string>EAP</string>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>CCPMPPE40Enabled</string>
					<key>pfm_title</key>
					<string>Enable CCPMPPE40</string>
					<key>pfm_description</key>
					<string>Enables encryption on the connection. If this key and CCPEnabled are true, represents maximum encryption level
</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>PPTP</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>CCPMPPE128Enabled</string>
					<key>pfm_title</key>
					<string>Enable CCPMPPE128</string>
					<key>pfm_description</key>
					<string>Enables encryption on the connection. If this key and CCPEnabled are true, represents automatic encryption level
</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>PPTP</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>CCPEnabled</string>
					<key>pfm_title</key>
					<string>Enable CCP</string>
					<key>pfm_description</key>
					<string>Enables encryption on the connection. If this key and CCPMPPE40Enabled are true, represents automatic encryption level; if this key and CCPMPPE128Enabled are true, represents maximum encryption level. If no encryption is used, then none of the CCP keys are true.
</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>PPTP</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>VPNType</string>
							<key>pfm_n_range_list</key>
							<array>
								<string>PPTP</string>
								<string>L2TP</string>
								<string>IKEv2</string>
								<string>AlwaysOn</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>IPSec</string>
			<key>pfm_title</key>
			<string>IPSec Settings</string>
			<key>pfm_description</key>
			<string>Dictionary containing IPSec settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_default</key>
			<dict>
				<key>AuthenticationMethod</key>
				<string>SharedSecret</string>
				<key>LocalIdentifierType</key>
				<string>KeyID</string>
			</dict>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>VPNType</string>
							<key>pfm_n_range_list</key>
							<array>
								<string>IPSec</string>
								<string>L2TP</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>RemoteAddress</string>
					<key>pfm_title</key>
					<string>Remote Address</string>
					<key>pfm_description</key>
					<string>IP address or hostname of the VPN server</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_title</key>
					<string>Authentication Method</string>
					<key>pfm_description</key>
					<string>Authentication method. Either shared secret or certificate</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_range_list</key>
									<array>
										<string>L2TP</string>
										<string>IPSec</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_range_list</key>
					<array>
						<string>SharedSecret</string>
						<string>Certificate</string>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
										<string>L2TP</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>XAuthName</string>
					<key>pfm_title</key>
					<string>Username</string>
					<key>pfm_description</key>
					<string>Username for VPN account</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>XAuthPassword</string>
					<key>pfm_title</key>
					<string>Password</string>
					<key>pfm_description</key>
					<string>Password for VPN account</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>XAuthEnabled</string>
					<key>pfm_title</key>
					<string>XAUTH Enabled</string>
					<key>pfm_description</key>
					<string>1 if XAUTH is ON, 0 if XAUTH is OFF</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>XAuthPasswordEncryption</string>
					<key>pfm_title</key>
					<string>XAUTH Password Encryption</string>
					<key>pfm_description</key>
					<string>String value is either &quot;Prompt&quot; or not present</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_range_list</key>
					<array>
						<string>Prompt</string>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>LocalIdentifier</string>
					<key>pfm_title</key>
					<string>Local Identifier</string>
					<key>pfm_description</key>
					<string>The name of the group to use. If Hybrid Authentication is used, the string must end with &quot;[hybrid]&quot;</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>LocalIdentifierType</string>
					<key>pfm_title</key>
					<string>Local Identifier Type</string>
					<key>pfm_description</key>
					<string>Present only if AuthenticationMethod = SharedSecret. Must be &quot;KeyID&quot;</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_range_list</key>
					<array>
						<string>KeyID</string>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
										<string>L2TP</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>SharedSecret</string>
					<key>pfm_title</key>
					<string>Shared Secret</string>
					<key>pfm_description</key>
					<string>The shared secret for this VPN account</string>
					<key>pfm_type</key>
					<string>data</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>SharedSecret</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>Certificate UUID</string>
					<key>pfm_description</key>
					<string>The UUID of the certificate to use for account credentials</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
									<key>pfm_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>PromptForVPNPIN</string>
					<key>pfm_title</key>
					<string>Prompt for PIN</string>
					<key>pfm_description</key>
					<string>If set, user will be prompted for a PIN when connecting</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>OnDemandEnabled</string>
					<key>pfm_title</key>
					<string>Enable VPN On Demand</string>
					<key>pfm_description</key>
					<string>Enable VPN On Demand</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsAlways</string>
					<key>pfm_title</key>
					<string>On Demand Match Domains Always</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainAlwaysElement</string>
							<key>pfm_title</key>
							<string>Match Domain Always Element</string>
							<key>pfm_description</key>
							<string>Match domain or host</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsNever</string>
					<key>pfm_title</key>
					<string>On Demand Match Domains Never</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainNeverElement</string>
							<key>pfm_title</key>
							<string>Match Domain Never Element</string>
							<key>pfm_description</key>
							<string>Match domain or host</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>VPNType</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsOnRetry</string>
					<key>pfm_title</key>
					<string>On Demand Match Domains On Retry</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainOnRetryElement</string>
							<key>pfm_title</key>
							<string>Match Domain On Retry Element</string>
							<key>pfm_description</key>
							<string>Match domain or host</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>OnDemandRules</string>
					<key>pfm_title</key>
					<string>On Demand Rules</string>
					<key>pfm_description</key>
					<string>An array of dictionaries defining On Demand Rules</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>OnDemandRulesElement</string>
							<key>pfm_title</key>
							<string>On Demand Rules Element</string>
							<key>pfm_description</key>
							<string>An On Demand rule</string>
							<key>pfm_type</key>
							<string>dictionary</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>DNSDomainMatch</string>
									<key>pfm_title</key>
									<string>DNS Domain Match</string>
									<key>pfm_description</key>
									<string>An array of DNS addresses</string>
									<key>pfm_type</key>
									<string>array</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSDomainMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Domain Match Element</string>
											<key>pfm_description</key>
											<string>A DNS address. May include wildcards</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>DNSServerAddressMatch</string>
									<key>pfm_title</key>
									<string>DNS Server Address Match</string>
									<key>pfm_description</key>
									<string>An array of DNS Server Addresses</string>
									<key>pfm_type</key>
									<string>array</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSServerAddressMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Server Address Match Element</string>
											<key>pfm_description</key>
											<string>A DNS server address. May include wildcards</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>URLStringProbe</string>
									<key>pfm_title</key>
									<string>URL String Probe</string>
									<key>pfm_description</key>
									<string>A test URL</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_title</key>
									<string>On Demand Action</string>
									<key>pfm_description</key>
									<string>On Demand Action</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Ignore</string>
										<string>Connect</string>
										<string>Disconnect</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>EAP</string>
			<key>pfm_title</key>
			<string>EAP Settings</string>
			<key>pfm_description</key>
			<string>Dictionary containing EAP settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_subkeys</key>
			<array/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>IPv4</string>
			<key>pfm_title</key>
			<string>IPv4 Settings</string>
			<key>pfm_description</key>
			<string>Dictionary containing IPv4 settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_default</key>
			<dict>
				<key>OverridePrimary</key>
				<integer>0</integer>
			</dict>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>OverridePrimary</string>
					<key>pfm_title</key>
					<string>Override Primary Connection</string>
					<key>pfm_description</key>
					<string>If set, all network traffic is sent over the VPN interface</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>IKEv2</string>
			<key>pfm_title</key>
			<string>IKEv2</string>
			<key>pfm_description</key>
			<string>IKEv2 settings</string>
			<key>pfm_default</key>
			<dict>
				<key>ChildSecurityAssociationParameters</key>
				<dict>
					<key>LifeTimeInMinutes</key>
					<integer>1440</integer>
					<key>DiffieHellmanGroup</key>
					<integer>14</integer>
					<key>IntegrityAlgorithm</key>
					<string>SHA1-96</string>
					<key>EncryptionAlgorithm</key>
					<string>3DES</string>
				</dict>
				<key>IKESecurityAssociationParameters</key>
				<dict>
					<key>LifeTimeInMinutes</key>
					<integer>1440</integer>
					<key>DiffieHellmanGroup</key>
					<integer>14</integer>
					<key>IntegrityAlgorithm</key>
					<string>SHA1-96</string>
					<key>EncryptionAlgorithm</key>
					<string>3DES</string>
				</dict>
				<key>DisableRedirect</key>
				<integer>0</integer>
				<key>DisableMOBIKE</key>
				<integer>0</integer>
				<key>UseConfigurationAttributeInternalIPSubnet</key>
				<integer>0</integer>
				<key>EnablePFS</key>
				<integer>0</integer>
				<key>EnableCertificateRevocationCheck</key>
				<integer>0</integer>
				<key>DeadPeerDetectionRate</key>
				<string>Medium</string>
				<key>AuthenticationMethod</key>
				<string>SharedSecret</string>
			</dict>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>VPNType</string>
							<key>pfm_n_range_list</key>
							<array>
								<string>IKEv2</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>RemoteAddress</string>
					<key>pfm_title</key>
					<string>RemoteAddress</string>
					<key>pfm_description</key>
					<string> IP address or hostname of the VPN server</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_require</key>
					<string>always</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>LocalIdentifier</string>
					<key>pfm_title</key>
					<string>LocalIdentifier</string>
					<key>pfm_description</key>
					<string>Identifier of the IKEv2 client</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_require</key>
					<string>always</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>RemoteIdentifier</string>
					<key>pfm_title</key>
					<string>RemoteIdentifier</string>
					<key>pfm_description</key>
					<string>Remote Identifier of the IKEv2 client</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_require</key>
					<string>always</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_title</key>
					<string>AuthenticationMethod</string>
					<key>pfm_description</key>
					<string>AuthenticationMethod of the IKEv2 client</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_range_list</key>
					<array>
						<string>SharedSecret</string>
						<string>Certificate</string>
						<string>None</string>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_description</key>
					<string>The UUID of the identity certificate as the account credential</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>SharedSecret</string>
					<key>pfm_title</key>
					<string>SharedSecret</string>
					<key>pfm_description</key>
					<string>Value for IKE authentication</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ExtendedAuthEnabled</string>
					<key>pfm_title</key>
					<string>ExtendedAuthEnabled</string>
					<key>pfm_description</key>
					<string>Set to 1 to enable extended authentication (EAP)</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>AuthName</string>
					<key>pfm_title</key>
					<string>AuthName</string>
					<key>pfm_description</key>
					<string>Username used for authentication</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>DisableRedirect</string>
					<key>pfm_title</key>
					<string>Disable Redirect</string>
					<key>pfm_description</key>
					<string>Set to 1 to disable IKEv2 redirect</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>DisableMOBIKE</string>
					<key>pfm_title</key>
					<string>Disable Mobility and Multihoming</string>
					<key>pfm_description</key>
					<string>Set to 1 to disable MOBIKE negotiation in IKEv2</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>UseConfigurationAttributeInternalIPSubnet</string>
					<key>pfm_title</key>
					<string>Use IPv4 / IPv6 Internal Subnet Attributes</string>
					<key>pfm_description</key>
					<string>Set to 1 to indicate if negotiation should use IKEv2 Configuration Attribute INTERNAL_IP4_SUBNET and INTERNAL_IP6_SUBNET.</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>EnablePFS</string>
					<key>pfm_title</key>
					<string>Enable perfect forward secrecy</string>
					<key>pfm_description</key>
					<string>Set to 1 to enable Perfect Forward Secrecy for IKEv2 connections</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ServerAddresses</string>
					<key>pfm_title</key>
					<string>An array of DNS server IP address strings</string>
					<key>pfm_description</key>
					<string>An array of DNS server IP address strings (IPv4 or IPv6)</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_macos_min</key>
					<string>10.12</string>
					<key>pfm_ios_min</key>
					<string>10.0</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>SearchDomains</string>
					<key>pfm_title</key>
					<string>A list of domain strings used to fully qualify single-label host names.</string>
					<key>pfm_description</key>
					<string>A list of domain strings used to fully qualify single-label host names.</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_macos_min</key>
					<string>10.12</string>
					<key>pfm_ios_min</key>
					<string>10.0</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>DomainName</string>
					<key>pfm_title</key>
					<string>The primary domain of the tunnel</string>
					<key>pfm_description</key>
					<string>The primary domain of the tunnel</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_macos_min</key>
					<string>10.12</string>
					<key>pfm_ios_min</key>
					<string>10.0</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>SupplementalMatchDomains</string>
					<key>pfm_title</key>
					<string>A list of domain strings used to determine which DNS queries will use the DNS resolver settings contained in ServerAddresses.</string>
					<key>pfm_description</key>
					<string>A list of domain strings used to determine which DNS queries will use the DNS resolver settings contained in ServerAddresses.</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_macos_min</key>
					<string>10.12</string>
					<key>pfm_ios_min</key>
					<string>10.0</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>EnableCertificateRevocationCheck</string>
					<key>pfm_title</key>
					<string>Enable certificate revocation check</string>
					<key>pfm_description</key>
					<string>Set to 1 to enable certificate revocation check for IKEv2 connections</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>AuthPassword</string>
					<key>pfm_title</key>
					<string>AuthPassword</string>
					<key>pfm_description</key>
					<string>Password used for authentication</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>DeadPeerDetectionRate</string>
					<key>pfm_title</key>
					<string>Dead Peer Detection Rate</string>
					<key>pfm_description</key>
					<string>Dead peer detection rate</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>Medium</string>
					<key>pfm_range_list</key>
					<array>
						<string>None</string>
						<string>Low</string>
						<string>Medium</string>
						<string>High</string>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>CertificateType</string>
					<key>pfm_title</key>
					<string>Certificate Type</string>
					<key>pfm_description</key>
					<string>Type of the certificate; defaults to RSA</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>IKEv2.AuthenticationMethod</string>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ServerCertificateIssuerCommonName</string>
					<key>pfm_title</key>
					<string>ServerCertificateIssuerCommonName</string>
					<key>pfm_description</key>
					<string>Common Name of the server certificate issuer</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ServerCertificateCommonName</string>
					<key>pfm_title</key>
					<string>ServerCertificateCommonName</string>
					<key>pfm_description</key>
					<string>Common name of the server certificate</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>NATKeepAliveOffloadEnable</string>
					<key>pfm_title</key>
					<string>NAT Keepalive offload for Always On VPN IKEv2 connections</string>
					<key>pfm_description</key>
					<string>Set to 1 to enable or 0 to disable NAT Keepalive offload for Always On VPN IKEv2 connections</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_default</key>
					<integer>1</integer>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>NATKeepAliveInterval</string>
					<key>pfm_title</key>
					<string>NAT Keepalive interval for Always On VPN IKEv2 connections</string>
					<key>pfm_description</key>
					<string>NAT Keepalive interval for Always On VPN IKEv2 connections</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>IKESecurityAssociationParameters</string>
					<key>pfm_title</key>
					<string>IKESecurityAssociationParameters</string>
					<key>pfm_description</key>
					<string>Applies to child Security Association</string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_default</key>
					<dict>
						<key>EncryptionAlgorithm</key>
						<string>3DES</string>
						<key>IntegrityAlgorithm</key>
						<string>SHA-96</string>
						<key>DiffieHellmanGroup</key>
						<integer>14</integer>
						<key>LifeTimeInMinutes</key>
						<integer>1440</integer>
					</dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_title</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_description</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_title</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_description</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_title</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_description</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_title</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_description</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ChildSecurityAssociationParameters</string>
					<key>pfm_title</key>
					<string>ChildSecurityAssociationParameters</string>
					<key>pfm_description</key>
					<string>Applies to child Security Association</string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_default</key>
					<dict>
						<key>EncryptionAlgorithm</key>
						<string>3DES</string>
						<key>IntegrityAlgorithm</key>
						<string>SHA-96</string>
						<key>DiffieHellmanGroup</key>
						<integer>14</integer>
						<key>LifeTimeInMinutes</key>
						<integer>1440</integer>
					</dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_title</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_description</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_title</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_description</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_title</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_description</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_title</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_description</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>AlwaysOn</string>
			<key>pfm_title</key>
			<string>AlwaysOn</string>
			<key>pfm_description</key>
			<string>Always On settings</string>
			<key>pfm_default</key>
			<dict>
				<key>ServiceExceptions</key>
				<array/>
				<key>AllowedCaptiveNetworkPlugins</key>
				<array/>
				<key>TunnelConfigurations</key>
				<array>
					<dict>
						<key>AuthenticationMethod</key>
						<string>SharedSecret</string>
						<key>DeadPeerDetectionRate</key>
						<string>Medium</string>
						<key>DisableRedirect</key>
						<integer>0</integer>
						<key>DisableMOBIKE</key>
						<integer>0</integer>
						<key>UseConfigurationAttributeInternalIPSubnet</key>
						<integer>0</integer>
						<key>EnablePFS</key>
						<integer>0</integer>
						<key>EnableCertificateRevocationCheck</key>
						<integer>0</integer>
						<key>NATKeepAliveOffloadEnable</key>
						<integer>1</integer>
						<key>NATKeepAliveInterval</key>
						<integer>110</integer>
						<key>IKESecurityAssociationParameters</key>
						<dict>
							<key>LifeTimeInMinutes</key>
							<integer>1440</integer>
							<key>DiffieHellmanGroup</key>
							<integer>14</integer>
							<key>IntegrityAlgorithm</key>
							<string>SHA1-96</string>
							<key>EncryptionAlgorithm</key>
							<string>3DES</string>
						</dict>
						<key>ChildSecurityAssociationParameters</key>
						<dict>
							<key>LifeTimeInMinutes</key>
							<integer>1440</integer>
							<key>DiffieHellmanGroup</key>
							<integer>14</integer>
							<key>IntegrityAlgorithm</key>
							<string>SHA1-96</string>
							<key>EncryptionAlgorithm</key>
							<string>3DES</string>
						</dict>
						<key>ProtocolType</key>
						<string>IKEv2</string>
						<key>Interfaces</key>
						<array>
							<string>Cellular</string>
						</array>
					</dict>
					<dict>
						<key>AuthenticationMethod</key>
						<string>SharedSecret</string>
						<key>DeadPeerDetectionRate</key>
						<string>Medium</string>
						<key>DisableRedirect</key>
						<integer>0</integer>
						<key>DisableMOBIKE</key>
						<integer>0</integer>
						<key>UseConfigurationAttributeInternalIPSubnet</key>
						<integer>0</integer>
						<key>EnablePFS</key>
						<integer>0</integer>
						<key>EnableCertificateRevocationCheck</key>
						<integer>0</integer>
						<key>NATKeepAliveOffloadEnable</key>
						<integer>1</integer>
						<key>NATKeepAliveInterval</key>
						<integer>20</integer>
						<key>IKESecurityAssociationParameters</key>
						<dict>
							<key>LifeTimeInMinutes</key>
							<integer>1440</integer>
							<key>DiffieHellmanGroup</key>
							<integer>14</integer>
							<key>IntegrityAlgorithm</key>
							<string>SHA1-96</string>
							<key>EncryptionAlgorithm</key>
							<string>3DES</string>
						</dict>
						<key>ChildSecurityAssociationParameters</key>
						<dict>
							<key>LifeTimeInMinutes</key>
							<integer>1440</integer>
							<key>DiffieHellmanGroup</key>
							<integer>14</integer>
							<key>IntegrityAlgorithm</key>
							<string>SHA1-96</string>
							<key>EncryptionAlgorithm</key>
							<string>3DES</string>
						</dict>
						<key>ProtocolType</key>
						<string>IKEv2</string>
						<key>Interfaces</key>
						<array>
							<string>WiFi</string>
						</array>
					</dict>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>VPNType</string>
							<key>pfm_range_list</key>
							<array>
								<string>IKEv2</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>TunnelConfigurations</string>
					<key>pfm_title</key>
					<string>TunnelConfigurations</string>
					<key>pfm_description</key>
					<string>This array contains an arbitrary number of TunnelConfigurations</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>TunnelConfiguration</string>
							<key>pfm_title</key>
							<string>A TunnelConfiguration</string>
							<key>pfm_description</key>
							<string>An item in theTunnelConfigurations array describing an individual configuration</string>
							<key>pfm_type</key>
							<string>dictionary</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>RemoteAddress</string>
									<key>pfm_title</key>
									<string>RemoteAddress</string>
									<key>pfm_description</key>
									<string> IP address or hostname of the VPN server</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_require</key>
									<string>always</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>LocalIdentifier</string>
									<key>pfm_title</key>
									<string>LocalIdentifier</string>
									<key>pfm_description</key>
									<string>Identifier of the IKEv2 client</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_require</key>
									<string>always</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>RemoteIdentifier</string>
									<key>pfm_title</key>
									<string>RemoteIdentifier</string>
									<key>pfm_description</key>
									<string>Remote Identifier of the IKEv2 client</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_require</key>
									<string>always</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>AuthenticationMethod</string>
									<key>pfm_title</key>
									<string>AuthenticationMethod</string>
									<key>pfm_description</key>
									<string>AuthenticationMethod of the IKEv2 client</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_require</key>
									<string>always</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>PayloadCertificateUUID</string>
									<key>pfm_title</key>
									<string>PayloadCertificateUUID</string>
									<key>pfm_description</key>
									<string>The UUID of the identity certificate as the account credential</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>SharedSecret</string>
									<key>pfm_title</key>
									<string>SharedSecret</string>
									<key>pfm_description</key>
									<string>Value for IKE authentication</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>ExtendedAuthEnabled</string>
									<key>pfm_title</key>
									<string>ExtendedAuthEnabled</string>
									<key>pfm_description</key>
									<string>Set to 1 to enable extended authentication (EAP)</string>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>DisableRedirect</string>
									<key>pfm_title</key>
									<string>Disable Redirect</string>
									<key>pfm_description</key>
									<string>Set to 1 to disable IKEv2 redirect</string>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>DisableMOBIKE</string>
									<key>pfm_title</key>
									<string>Disable Mobility and Multihoming</string>
									<key>pfm_description</key>
									<string>Set to 1 to disable MOBIKE negotiation in IKEv2</string>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>UseConfigurationAttributeInternalIPSubnet</string>
									<key>pfm_title</key>
									<string>Use IPv4 / IPv6 Internal Subnet Attributes</string>
									<key>pfm_description</key>
									<string>Set to 1 to indicate if negotiation should use IKEv2 Configuration Attribute INTERNAL_IP4_SUBNET and INTERNAL_IP6_SUBNET.</string>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>EnablePFS</string>
									<key>pfm_title</key>
									<string>Enable perfect forward secrecy</string>
									<key>pfm_description</key>
									<string>Set to 1 to enable Perfect Forward Secrecy for IKEv2 connections</string>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>EnableCertificateRevocationCheck</string>
									<key>pfm_title</key>
									<string>Enable certificate revocation check</string>
									<key>pfm_description</key>
									<string>Set to 1 to enable certificate revocation check for IKEv2 connections</string>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>NATKeepAliveOffloadEnable</string>
									<key>pfm_title</key>
									<string>Enable NAT keepalive while the device is asleep</string>
									<key>pfm_description</key>
									<string>Set to 1 to enable NAT Keepalive offload for Always-on VPN IKEv2 connections</string>
									<key>pfm_default</key>
									<integer>1</integer>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>NATKeepAliveInterval</string>
									<key>pfm_title</key>
									<string>NAT Keepalive Interval</string>
									<key>pfm_description</key>
									<string>NAT Keepalive interval for Always-on VPN IKEv2 connections. This value controls the interval over which Keepalive offload packets are sent by the device. The minimum value is 20 seconds. If no key is specified, the default is 20 seconds over Wi-Fi and 110 seconds over Cellular interface.</string>
									<key>pfm_default</key>
									<integer>20</integer>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>AuthName</string>
									<key>pfm_title</key>
									<string>AuthName</string>
									<key>pfm_description</key>
									<string>Username used for authentication</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>AuthPassword</string>
									<key>pfm_title</key>
									<string>AuthPassword</string>
									<key>pfm_description</key>
									<string>Password used for authentication</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>DeadPeerDetectionRate</string>
									<key>pfm_title</key>
									<string>Dead Peer Detection Rate</string>
									<key>pfm_description</key>
									<string>Dead peer detection rate; defaults to Medium</string>
									<key>pfm_default</key>
									<string>Low</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>ServerCertificateIssuerCommonName</string>
									<key>pfm_title</key>
									<string>ServerCertificateIssuerCommonName</string>
									<key>pfm_description</key>
									<string>Common Name of the server certificate issuer</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_conditionals</key>
									<array>
										<dict>
											<key>pfm_require</key>
											<string>always</string>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_target</key>
													<string>IKEv2.AuthenticationMethod</string>
													<key>pfm_range_list</key>
													<array>
														<string>Certificate</string>
													</array>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_target</key>
													<string>AlwaysOn.TunnelConfigurations.[0].AuthenticationMethod</string>
													<key>pfm_n_range_list</key>
													<array>
														<string>Certificate</string>
													</array>
												</dict>
												<dict>
													<key>pfm_target</key>
													<string>AlwaysOn.TunnelConfigurations.[1].AuthenticationMethod</string>
													<key>pfm_n_range_list</key>
													<array>
														<string>Certificate</string>
													</array>
												</dict>
											</array>
										</dict>
									</array>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>ServerCertificateCommonName</string>
									<key>pfm_title</key>
									<string>ServerCertificateCommonName</string>
									<key>pfm_description</key>
									<string>Common Name of the server certificate</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_target</key>
													<string>AlwaysOn.TunnelConfigurations.[0].AuthenticationMethod</string>
													<key>pfm_n_range_list</key>
													<array>
														<string>Certificate</string>
													</array>
												</dict>
												<dict>
													<key>pfm_target</key>
													<string>AlwaysOn.TunnelConfigurations.[1].AuthenticationMethod</string>
													<key>pfm_n_range_list</key>
													<array>
														<string>Certificate</string>
													</array>
												</dict>
											</array>
										</dict>
									</array>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>IKESecurityAssociationParameters</string>
									<key>pfm_title</key>
									<string>IKESecurityAssociationParameters</string>
									<key>pfm_description</key>
									<string>Applies to child Security Association</string>
									<key>pfm_type</key>
									<string>dictionary</string>
									<key>pfm_default</key>
									<dict>
										<key>EncryptionAlgorithm</key>
										<string>3DES</string>
										<key>IntegrityAlgorithm</key>
										<string>SHA-96</string>
										<key>DiffieHellmanGroup</key>
										<integer>14</integer>
										<key>LifeTimeInMinutes</key>
										<integer>1440</integer>
									</dict>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_title</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_description</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_name</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_title</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_description</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_name</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_title</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_description</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
										<dict>
											<key>pfm_name</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_title</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_description</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
									</array>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>ChildSecurityAssociationParameters</string>
									<key>pfm_title</key>
									<string>ChildSecurityAssociationParameters</string>
									<key>pfm_description</key>
									<string>Applies to child Security Association</string>
									<key>pfm_type</key>
									<string>dictionary</string>
									<key>pfm_default</key>
									<dict>
										<key>EncryptionAlgorithm</key>
										<string>3DES</string>
										<key>IntegrityAlgorithm</key>
										<string>SHA-96</string>
										<key>DiffieHellmanGroup</key>
										<integer>14</integer>
										<key>LifeTimeInMinutes</key>
										<integer>1440</integer>
									</dict>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_title</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_description</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_name</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_title</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_description</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_name</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_title</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_description</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
										<dict>
											<key>pfm_name</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_title</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_description</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
        <dict>
            <key>pfm_name</key>
            <string>DisconnectOnIdle</string>
            <key>pfm_title</key>
            <string>DisconnectOnIdle</string>
            <key>pfm_description</key>
            <string>DisconnectOnIdle</string>
            <key>pfm_type</key>
            <string>integer</string>
            <key>pfm_default</key>
            <integer>0</integer>
        </dict>
        <dict>
            <key>pfm_name</key>
            <string>DisconnectOnIdleTimer</string>
            <key>pfm_title</key>
            <string>DisconnectOnIdleTimer</string>
            <key>pfm_description</key>
            <string>DisconnectOnIdleTimer</string>
            <key>pfm_type</key>
            <string>integer</string>
            <key>pfm_conditionals</key>
            <array>
                <dict>
                    <key>pfm_require</key>
                    <string>always</string>
                    <key>pfm_target_conditions</key>
                    <array>
                        <dict>
                            <key>pfm_target</key>
                            <string>DisconnectOnIdle</string>
                            <key>pfm_range_list</key>
                            <array>
                                <integer>1</integer>
                            </array>
                        </dict>
                    </array>
                </dict>
            </array>
            <key>pfm_exclude</key>
            <array>
                <dict>
                    <key>pfm_target_conditions</key>
                    <array>
                        <dict>
                            <key>pfm_target</key>
                            <string>DisconnectOnIdle</string>
                            <key>pfm_n_range_list</key>
                            <array>
                                <integer>1</integer>
                            </array>
                        </dict>
                    </array>
                </dict>
            </array>
        </dict>
    </array>
</dict>
</plist>
