<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>FileVault 2</string>
        <key>pfm_title</key>
        <string>FileVault 2</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.MCX.FileVault2</string>
        <key>pfm_macos_min</key>
        <string>10.9</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Payload Description</string>
                <key>pfm_description</key>
                <string>Description of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>FileVault 2</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
                <key>pfm_description</key>
                <string>Name of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>FileVault 2</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
                <key>pfm_description</key>
                <string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.MCX.FileVault2</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
                <key>pfm_description</key>
                <string>The type of the payload, a reverse dns string</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.MCX.FileVault2</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
                <key>pfm_description</key>
                <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string></string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
                <key>pfm_description</key>
                <string>The version of the whole configuration profile.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
                <key>pfm_description</key>
                <string>This value describes the issuing organization of the profile, as displayed to the user</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Enable</string>
                <key>pfm_title</key>
                <string>Enable FileVault 2</string>
                <key>pfm_description</key>
                <string>Set to 'On' to enable FileVault. Set to 'Off' to disable FileVault. This value is required.</string>
                <key>pfm_type</key>
                <string>boolean</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Defer</string>
                <key>pfm_title</key>
                <string>Defer enabling until logout</string>
                <key>pfm_description</key>
                <string>Set to true to defer enabling FileVault until the designated user logs out. For details, see fdesetup(8). The person enabling FileVault must be either a local user or a mobile account user.</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>UserEntersMissingInfo</string>
                <key>pfm_title</key>
                <string>User enters username and password</string>
                <key>pfm_description</key>
                <string>Set to true for manual profile installs to prompt for missing user name or password fields.</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>UseRecoveryKey</string>
                <key>pfm_title</key>
                <string>Create a personal recovery key</string>
                <key>pfm_description</key>
                <string>Set to true to create a personal recovery key</string>
                <key>pfm_type</key>
                <string>boolean</string>
                <key>pfm_default</key>
                <true/>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>ShowRecoveryKey</string>
                <key>pfm_title</key>
                <string>Show the personal recovery key</string>
                <key>pfm_description</key>
                <string>Set to false to not display the personal recovery key to the user after FileVault is enabled</string>
                <key>pfm_type</key>
                <string>boolean</string>
                <key>pfm_default</key>
                <true/>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>OutputPath</string>
                <key>pfm_title</key>
                <string>Recovery key path</string>
                <key>pfm_description</key>
                <string>Path to the location where the recovery key and computer information plist will be stored.</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Certificate</string>
                <key>pfm_title</key>
                <string>Certificate</string>
                <key>pfm_description</key>
                <string>DER-encoded certificate data if an institutional recovery key will be added.</string>
                <key>pfm_type</key>
                <string>data</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadCertificateUUID</string>
                <key>pfm_title</key>
                <string>Recovery Key Certificate Payload</string>
                <key>pfm_description</key>
                <string>UUID of the payload containing the asymmetric recovery key certificate payload.</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Username</string>
                <key>pfm_title</key>
                <string>Username</string>
                <key>pfm_description</key>
                <string>User name of the Open Directory user that will be added to FileVault.</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Password</string>
                <key>pfm_title</key>
                <string>Password</string>
                <key>pfm_description</key>
                <string>User password of the Open Directory user that will be added to FileVault. Use the UserEntersMissingInfo key if you want to prompt for this information.</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>UseKeychain</string>
                <key>pfm_title</key>
                <string>Add institutional recovery key to keychain</string>
                <key>pfm_description</key>
                <string>If set to true and no certificate information is provided in this payload, the keychain already created at /Library/Keychains/FileVaultMaster.keychain will be used when the institutional recovery key is added.</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>DeferForceAtUserLoginMaxBypassAttempts</string>
                <key>pfm_title</key>
                <string>Maximum number of times FileVault can be skipped</string>
                <key>pfm_description</key>
                <string>When using the Defer option you can optionally set this key to the maximum number of times the user can bypass enabling FileVault before it will require that it be enabled before the user can log in. If set to 0, it will always prompt to enable FileVault until it is enabled, though it will allow you to bypass enabling it. Setting this key to –1 will disable this feature.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_macos_min</key>
                <string>10.10.0</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>DeferDontAskAtUserLogout</string>
                <key>pfm_title</key>
                <string>Dont ask at logout</string>
                <key>pfm_description</key>
                <string>When using the Defer option, set this key to true to not request enabling FileVault at user logout time.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_macos_min</key>
                <string>10.10.0</string>
            </dict>
        </array>
    </dict>
</plist>
