<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define settings for configuration access to CardDAV servers.</string>
	<key>pfm_title</key>
	<string>CardDAV</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_version</key>
	<integer>1</integer>
	<key>pfm_domain</key>
	<string>com.apple.carddav.account</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>Configures a CardDAV account</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>CardDAV</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.carddav.account</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.carddav.account</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>CardDAVAccountDescription</string>
			<key>pfm_title</key>
			<string>Account Description</string>
			<key>pfm_description</key>
			<string>The display name of the account (e.g. &quot;Company CardDAV Account&quot;)</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>My CardDAV Account</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>CardDAVPort</string>
			<key>pfm_title</key>
			<string>Port Number</string>
			<key>pfm_description</key>
			<string>The port number to connect to the CardDAV server</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>443</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_range_max</key>
			<integer>65535</integer>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>CardDAVHostName</string>
			<key>pfm_title</key>
			<string>Account Hostname</string>
			<key>pfm_description</key>
			<string>The CardDAV server hostname or IP address</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>CardDAVUseSSL</string>
			<key>pfm_title</key>
			<string>Use SSL</string>
			<key>pfm_description</key>
			<string>Enable Secure Socket Layer communication with CardDAV server</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>CardDAVPrincipalURL</string>
			<key>pfm_title</key>
			<string>Principal URL</string>
			<key>pfm_description</key>
			<string>The Principal URL for the CardDAV account</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>CardDAVUsername</string>
			<key>pfm_title</key>
			<string>Account Username</string>
			<key>pfm_description</key>
			<string>The CardDAV username</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_require</key>
			<string>push</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>CardDAVPassword</string>
			<key>pfm_title</key>
			<string>Account Password</string>
			<key>pfm_description</key>
			<string>The CardDAV password</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>CommunicationServiceRules</string>
			<key>pfm_title</key>
			<string>Communication Service Rules</string>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>DefaultServiceHandlers</string>
					<key>pfm_title</key>
					<string>Default Service Handlers</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>AudioCall</string>
							<key>pfm_title</key>
							<string>App for audio calls</string>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_required</key>
					<true/>
				</dict>
			</array>
		</dict>
	</array>
</dict>
</plist>
