<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define custom APNs for cellular data access.</string>
	<key>pfm_title</key>
	<string>Cellular</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_version</key>
	<integer>1</integer>
	<key>pfm_domain</key>
	<string>com.apple.cellular</string>
	<key>pfm_ios_min</key>
	<string>7.0</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>Configures cellular data settings</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>Cellular</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.cellular</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.cellular</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>APNs</string>
			<key>pfm_title</key>
			<string>APNs</string>
			<key>pfm_description</key>
			<string>List of APNs to configure</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_default</key>
			<array/>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>APN</string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_default</key>
					<dict/>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Name</string>
							<key>pfm_title</key>
							<string>Name</string>
							<key>pfm_description</key>
							<string>Access Point Name of the APN configuration</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>AuthenticationType</string>
							<key>pfm_title</key>
							<string>Authentication type</string>
							<key>pfm_description</key>
							<string>CHAP or PAP</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_default</key>
							<string>PAP</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>Username</string>
							<key>pfm_title</key>
							<string>User name</string>
							<key>pfm_description</key>
							<string>A username for the service.</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>Password</string>
							<key>pfm_title</key>
							<string>Password</string>
							<key>pfm_description</key>
							<string>A password for the service.</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>ProxyServer</string>
							<key>pfm_title</key>
							<string>Proxy server</string>
							<key>pfm_description</key>
							<string>Optional proxy server hostname or address</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>ProxyPort</string>
							<key>pfm_title</key>
							<string>Proxy port</string>
							<key>pfm_description</key>
							<string>Optional proxy server port number</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>DefaultProtocolMask</string>
							<key>pfm_title</key>
							<string>Default Internet Protocol Versions</string>
							<key>pfm_description</key>
							<string>Deprecated. Default Internet Protocol versions. Set to the same value as AllowedProtocolMask. Possible values are: 1 = IPv4, 2 = IPv6, and 3 = Both.</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_ios_min</key>
							<string>10.3</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>AllowedProtocolMask</string>
							<key>pfm_title</key>
							<string>Allowed Internet Protocol Versions</string>
							<key>pfm_description</key>
							<string>Supported Internet Protocol versions. Possible values are: 1 = IPv4, 2 = IPv6, and 3 = Both.</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_ios_min</key>
							<string>10.3</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>AllowedProtocolMaskInRoaming</string>
							<key>pfm_title</key>
							<string>Allowed Internet Protocol Versions while roaming</string>
							<key>pfm_description</key>
							<string>Supported Internet Protocol versions. Possible values are: 1 = IPv4, 2 = IPv6, and 3 = Both.</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_ios_min</key>
							<string>10.3</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>AllowedProtocolMaskInDomesticRoaming</string>
							<key>pfm_title</key>
							<string>Allowed Internet Protocol Versions while domestic roaming</string>
							<key>pfm_description</key>
							<string>Supported Internet Protocol versions. Possible values are: 1 = IPv4, 2 = IPv6, and 3 = Both.</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_ios_min</key>
							<string>10.3</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>AttachAPN</string>
			<key>pfm_title</key>
			<string>AttachAPN</string>
			<key>pfm_description</key>
			<string>Default APN configuration</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_default</key>
			<dict/>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>Name</string>
					<key>pfm_title</key>
					<string>Name</string>
					<key>pfm_description</key>
					<string>Name of the APN configuration</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>AuthenticationType</string>
					<key>pfm_title</key>
					<string>Authentication type</string>
					<key>pfm_description</key>
					<string>CHAP or PAP</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>PAP</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>Username</string>
					<key>pfm_title</key>
					<string>User name</string>
					<key>pfm_description</key>
					<string>A username for the service.</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>Password</string>
					<key>pfm_title</key>
					<string>Password</string>
					<key>pfm_description</key>
					<string>A password for the service.</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
		</dict>
	</array>
</dict>
</plist>
