<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>Home Screen Layout Payload</string>
        <key>pfm_title</key>
        <string>Home Screen Layout Payload</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.homescreenlayout</string>
        <key>pfm_ios_min</key>
        <string>9.3</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Payload Description</string>
                <key>pfm_description</key>
                <string>Description of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Home Screen Layout</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
                <key>pfm_description</key>
                <string>Name of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Home Screen Layout</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
                <key>pfm_description</key>
                <string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.homescreenlayout</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
                <key>pfm_description</key>
                <string>The type of the payload, a reverse dns string</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.homescreenlayout</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
                <key>pfm_description</key>
                <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string></string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
                <key>pfm_description</key>
                <string>The version of the whole configuration profile.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
                <key>pfm_description</key>
                <string>This value describes the issuing organization of the profile, as displayed to the user</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Dock</string>
                <key>pfm_title</key>
                <string>Dock Items</string>
                <key>pfm_description</key>
                <string>Optional. An array of dictionaries, each of which must conform to the icon dictionary format.</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>DockItem</string>
                        <key>pfm_title</key>
                        <string>Dock Item</string>
                        <key>pfm_description</key>
                        <string>An item in the dock</string>
                        <key>pfm_type</key>
                        <string>dictionary</string>
                        <key>pfm_require</key>
                        <string>always</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>Type</string>
                                <key>pfm_title</key>
                                <string>Item Type</string>
                                <key>pfm_description</key>
                                <string>Type of the item to add</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_require</key>
                                <string>always</string>
                                <key>pfm_range_list</key>
                                <array>
                                    <string>Application</string>
                                    <string>Folder</string>
                                </array>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>DisplayName</string>
                                <key>pfm_title</key>
                                <string>Display Name</string>
                                <key>pfm_description</key>
                                <string>Human-readable string to be shown to the user.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>BundleID</string>
                                <key>pfm_title</key>
                                <string>Bundle ID</string>
                                <key>pfm_description</key>
                                <string>Required if App type. The bundle identifier of the app.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>Pages</string>
                                <key>pfm_title</key>
                                <string>Home Screen Pages Items</string>
                                <key>pfm_description</key>
                                <string>Optional. An array of dictionaries, each of which must conform to the icon dictionary format.</string>
                                <key>pfm_type</key>
                                <string>array</string>
                            </dict>
                        </array>
                    </dict>
                </array>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Pages</string>
                <key>pfm_title</key>
                <string>Home Screen Pages Items</string>
                <key>pfm_description</key>
                <string>Optional. An array of dictionaries, each of which must conform to the icon dictionary format.</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>DockItem</string>
                        <key>pfm_title</key>
                        <string>Dock Item</string>
                        <key>pfm_description</key>
                        <string>An item in the dock</string>
                        <key>pfm_type</key>
                        <string>dictionary</string>
                        <key>pfm_require</key>
                        <string>always</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>Type</string>
                                <key>pfm_title</key>
                                <string>Item Type</string>
                                <key>pfm_description</key>
                                <string>Type of the item to add</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_require</key>
                                <string>always</string>
                                <key>pfm_range_list</key>
                                <array>
                                    <string>Application</string>
                                    <string>Folder</string>
                                </array>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>DisplayName</string>
                                <key>pfm_title</key>
                                <string>Display Name</string>
                                <key>pfm_description</key>
                                <string>Human-readable string to be shown to the user.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>BundleID</string>
                                <key>pfm_title</key>
                                <string>Bundle ID</string>
                                <key>pfm_description</key>
                                <string>Required if App type. The bundle identifier of the app.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>Pages</string>
                                <key>pfm_title</key>
                                <string>Home Screen Pages Items</string>
                                <key>pfm_description</key>
                                <string>Optional. An array of dictionaries, each of which must conform to the icon dictionary format.</string>
                                <key>pfm_type</key>
                                <string>array</string>
                            </dict>
                        </array>
                    </dict>
                </array>
            </dict>
        </array>
    </dict>
</plist>
