<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.SoftwareUpdate</string>
        <key>pfm_description</key>
        <string>Managed Client settings for Software Update</string>
        <key>pfm_name</key>
        <string>SoftwareUpdate</string>
        <key>pfm_title</key>
        <string>Software Update</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_description</key>
                <string>Specify a URL of the form http://server.example.com:8088/index.sucatalog</string>
                <key>pfm_name</key>
                <string>CatalogURL</string>
                <key>pfm_title</key>
                <string>Software Update Server</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>AllowPreReleaseInstallation</string>
                <key>pfm_title</key>
                <string>Allow installation of pre-release software</string>
                <key>pfm_description</key>
                <string>Allow installation of pre-release software</string>
                <key>pfm_type</key>
                <string>boolean</string>
                <key>pfm_default</key>
                <true/>
            </dict>
        </array>
    </dict>
</plist>

