<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.SoftwareUpdate</string>
        <key>pfm_description</key>
        <string>Managed Client settings for Software Update</string>
        <key>pfm_name</key>
        <string>SoftwareUpdate</string>
        <key>pfm_title</key>
        <string>Software Update</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_description</key>
                <string>Specify a URL of the form http://server.example.com:8088/index.sucatalog</string>
                <key>pfm_name</key>
                <string>CatalogURL</string>
                <key>pfm_title</key>
                <string>Software Update Server</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>AllowPreReleaseInstallation</string>
                <key>pfm_title</key>
                <string>Allow installation of pre-release software</string>
                <key>pfm_description</key>
                <string>Allow installation of pre-release software</string>
                <key>pfm_type</key>
                <string>boolean</string>
                <key>pfm_default</key>
                <true/>
            </dict>
            <dict>
                <key>pfm_description</key>
                <string>Optional. If true, software updates will be delayed by the duration defined by ManagedDeferredInstallDelay.</string>
                <key>pfm_name</key>
                <string>forceDelayedSoftwareUpdates</string>
                <key>pfm_title</key>
                <string>Force delayed updates</string>
                <key>pfm_type</key>
                <string>boolean</string>
                <key>pfm_default</key>
                <false/>
            </dict>
            <dict>
                <key>pfm_description</key>
                <string>Optional. The duration, in days, that software updates will be delayed, if forcedDelayedSoftwareUpdates is set to true. Default is 30.</string>
                <key>pfm_name</key>
                <string>ManagedDeferredInstallDelay</string>
                <key>pfm_title</key>
                <string>Update delay in days</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>30</integer>
                <key>pfm_macos_min</key>
                <string>10.13.4</string>
            </dict>
        </array>
    </dict>
</plist>

